var theCity = {
	"宁波":{
		"海曙区":{
			"title":"海曙区","position":[121.581716,29.860646]
		},
		"江北区":{
			"title":"江北区","position":[121.55642,29.901731]
		},
		"鄞州区":{
			"title":"鄞州区","position":[121.405792,29.860646]
		},
		"镇海区":{
			"title":"镇海区","position":[121.718546,29.963828]
		},
		"北仑区":{
			"title":"北仑区","position":[121.850777,29.91776]
		},
		"慈溪市":{
			"title":"慈溪区","position":[121.270112,30.186851]
		},
		"余姚市":{
			"title":"余姚市","position":[121.15,30.03]
		},
		"奉化区":{
			"title":"奉化区","position":[121.408092,29.674044]
		},
		"宁海县":{
			"title":"宁海县","position":[121.434538,29.311886]
		},
		"象山县":{
			"title":"象山县","position":[121.868024,29.496146]
		},
		"高新区":{
			"title":"高新区","position":[121.774888,29.905739]
		}
	}
};
var jb = {
	"江北区":{
		"慈城镇":{position:[121.456194,29.985877],tit:"慈城镇"},
		"中马街道":{position:[121.559893,29.89563],tit:"中马街道"},
		"白沙街道":{position:[121.573855,29.894159],tit:"白沙街道"},
		"孔浦街道":{position:[121.594218,29.907862],tit:"孔浦街道"},
		"甬江街道":{position:[121.589034,29.90868],tit:"甬江街道"},
		"洪塘街道":{position:[121.517925,29.954975],tit:"洪塘街道"},
		"文教街道":{position:[121.567925,29.924975],tit:"文教街道"},
		"庄桥街道":{position:[121.553774,29.929792],tit:"庄桥街道"}
	},
	"镇海区":{
		"澥浦镇":{tit:"澥浦镇",position:[121.607506,30.036932]},
	  	"蛟川街道":{tit:"蛟川街道",position:[121.686133,29.947305]},
	  	"骆驼街道":{tit:"骆驼街道",position:[121.590978,29.990809]},
	  	"庄市街道":{tit:"庄市街道",position:[121.627363,29.925424]},
	  	"九龙湖镇":{tit:"九龙湖镇",position:[121.558783,30.039215]},
	  	"招宝山街道":{tit:"招宝山街道",position:[121.723011,29.957719]}
	},
	"北仑区":{
		"戚家山街道":{position:[121.747494,29.957832],tit:"戚家山街道"},
		"白峰镇":{position:[122.002466,29.881123],tit:"白峰镇"},
		"春晓镇":{position:[121.911319,29.767465],tit:"春晓镇"},
		"梅山镇":{position:[122.001249,29.800679],tit:"梅山镇"},
		"柴桥街道":{position:[121.929377,29.88165],tit:"柴桥街道"},
		"小港街道":{position:[121.752551,29.95008],tit:"小港街道"},
		"大碶街道":{position:[121.801428,29.900224],tit:"大碶街道"},
		"新碶街道":{position:[121.841623,29.91905],tit:"新碶街道"},
		"霞浦街道":{position:[121.861623,29.90905],tit:"霞浦街道"}
	},
	"奉化区":{
		"萧王庙街道":{position:[121.364404,29.708239],tit:"萧王庙街道"},
		"尚田镇":{position:[121.415329,29.628016],tit:"尚田镇"},
		"莼湖镇":{position:[121.523201,29.57972],tit:"莼湖镇"},
		"裘村镇":{position:[121.629692,29.60953],tit:"裘村镇"},
		"大堰镇":{position:[121.310843,29.509988],tit:"大堰镇"},
		"松岙镇":{position:[121.69192,29.607259],tit:"松岙镇"},
		"锦屏街道":{position:[121.416777,29.681676],tit:"锦屏街道"},
		"岳林街道":{position:[121.446587,29.666678],tit:"岳林街道"},
		"江口街道":{position:[121.412958,29.730545],tit:"江口街道"},
		"西坞街道":{position:[121.499693,29.685171],tit:"西坞街道"},
		"萧王庙街道":{position:[121.364404,29.708239],tit:"萧王庙街道"}
	},
	"宁海县":{
		"长街镇":{position:[121.71965, 29.253484],tit:"长街镇"},
		"力洋镇":{position:[121.625271, 29.306536],tit:"力洋镇"},
		"一市镇": { position: [121.48604, 29.206363], tit: "一市镇" },
		"岔路镇":{position:[121.321331, 29.208305],tit:"岔路镇"},
		"前童镇": { position: [121.354864, 29.234539], tit: "前童镇" },
		"桑洲镇": { position: [121.324307, 29.160376], tit: "桑洲镇" },
		"黄坛镇": { position: [121.36886, 29.300804], tit: "黄坛镇" },
		"强蛟镇": { position: [121.537438, 29.463833], tit: "强蛟镇" },
		"西店镇": { position: [121.447155, 29.490239], tit: "西店镇" },
		"深圳镇": { position: [121.355087, 29.42138], tit: "深圳镇" },
		"胡陈乡": { position: [121.683749, 29.331784], tit: "胡陈乡" }, 
		"茶院乡": { position: [121.579185, 29.321058], tit: "茶院乡" } ,
		"越溪乡": { position: [121.528166, 29.270395], tit: "越溪乡" } ,
		"跃龙街道": { position: [121.440158, 29.301269], tit: "跃龙街道" },
		"桃源街道": { position: [121.462436, 29.342082], tit: "桃源街道" },
		"萧王庙街道":{position:[121.364404,29.708239],tit:"萧王庙街道"},
		"梅林街道": { position: [121.449328, 29.383534], tit: "梅林街道" },
		"大佳何镇": { position: [121.561765, 29.431585], tit: "大佳何镇" },
		"桥头胡街道":{position:[121.364404,29.708239],tit:"桥头胡街道"}
	},
	"象山县":{
		"西周镇":{tit:"西周镇",position:[121.68123,29.483584]},
      	"贤庠镇":{tit:"贤庠镇",position:[121.852859,29.594797]},
      	"大徐镇":{tit:"大徐镇",position:[121.890455,29.529312]},
      	"涂茨镇":{tit:"涂茨镇",position:[121.945702,29.566836]},
      	"晓塘乡":{tit:"晓塘乡",position:[121.865951,29.211672]},
        "茅洋乡":{tit:"茅洋乡",position:[121.837043,29.398557]},
      	"石浦镇":{tit:"石浦镇",position:[121.952946,29.21486]},
      	"墙头镇":{tit:"墙头镇",position:[121.789504,29.46924]},
      	"新桥镇":{tit:"新桥镇",position:[121.874525,29.319761]},
      	"定塘镇":{tit:"定塘镇",position:[121.851246,29.235198]},
      	"丹东街道":{tit:"丹东街道",position:[121.884625,29.485145]},
        "丹西街道":{tit:"丹西街道",position:[121.876867,29.479623]},
        "爵溪街道":{tit:"爵溪街道",position:[121.955053,29.477025]},
        "黄避岙乡":{tit:"黄避岙乡",position:[121.802284,29.579827]},
      	"泗洲头镇":{tit:"泗洲头镇",position:[121.779634,29.377887]}
	},
	"海曙区":{
		"洞桥镇":{position:[121.418006,29.786533],tit:"洞桥镇"},
		"高桥镇":{position:[121.468481,29.911006],tit:"高桥镇"},
		"古林镇":{position:[121.442866,29.841634],tit:"古林镇"},
		"横街镇":{position:[121.405703,29.859327],tit:"横街镇"},
		"龙观乡":{position:[121.32214,29.774013],tit:"龙观乡"},
		"鄞江镇":{position:[121.360949,29.776293],tit:"鄞江镇"},
		"南门街道":{position:[121.539746,29.877001],tit:"南门街道"},
		"江厦街道":{position:[121.561297,29.869307],tit:"江厦街道"},
		"西门街道":{position:[121.539452,29.888738],tit:"西门街道"},
		"月湖街道":{position:[121.553562,29.867453],tit:"月湖街道"},
		"鼓楼街道":{position:[121.548585,29.882739],tit:"鼓楼街道"},
		"白云街道":{position:[121.525032,29.875989],tit:"白云街道"},
		"段塘街道":{position:[121.533845,29.84763],tit:"段塘街道"},
		"望春街道":{position:[121.528185,29.89675],tit:"望春街道"},
		"石碶街道":{position:[121.51492,29.832532],tit:"石碶街道"},
		"集仕港镇":{position:[121.443952,29.872706],tit:"集仕港镇"}
		
	},
	
	"鄞州区":{
		"横溪镇":{position:[121.601946,29.735113],tit:"横溪镇"},
		"邱隘镇":{position:[121.646015,29.851735],tit:"邱隘镇"},
		"塘溪镇":{position:[121.72088,29.667871],tit:"塘溪镇"},
		"五乡镇":{position:[121.701679,29.85122],tit:"五乡镇"},
		"云龙镇":{position:[121.606747,29.779195],tit:"云龙镇"},
		"瞻岐镇":{position:[121.833221,29.735725],tit:"瞻岐镇"},
		"姜山镇":{position:[121.535785,29.776958],tit:"姜山镇"},
		"咸祥镇":{position:[121.781581,29.693036],tit:"咸祥镇"},
		"东吴镇":{position:[121.748009,29.822462],tit:"东吴镇"},
		"东胜街道":{position:[121.578571,29.882483],tit:"东胜街道"},
		"明楼街道":{position:[121.583127,29.888605],tit:"明楼街道"},
		"白鹤街道":{position:[121.575327,29.861402],tit:"白鹤街道"},
		"东柳街道":{position:[121.592284,29.862954],tit:"东柳街道"},
		"百丈街道":{position:[121.578075,29.870482],tit:"百丈街道"},
		"福明街道":{position:[121.609217,29.868882],tit:"福明街道"},
		"东郊街道":{position:[121.584635,29.875718],tit:"东郊街道"},
		"新明街道":{position:[121.618987,29.898833],tit:"新明街道"},
		"中河街道":{position:[121.589282,29.830737],tit:"中河街道"},
		"首南街道":{position:[121.552977,29.804436],tit:"首南街道"},
		"下应街道":{position:[121.598971,29.81455],tit:"下应街道"},
		"潘火街道":{position:[121.611885,29.833419],tit:"潘火街道"},
		"钟公庙街道":{position:[121.544818,29.830365],tit:"钟公庙街道"}
	},
	"高新区":{
		"新明街道":{position:[121.618987,29.898833],tit:"新明街道"},
		"梅墟街道":{position:[121.659319,29.905163],tit:"梅墟街道"},
		"贵驷街道":{position:[121.62439,29.985422],tit:"贵驷街道"}
	},
	"余姚市":{
		"马渚镇":{position:[121.06254,30.078481],tit:"马渚镇"},
		"牟山镇":{position:[121.007007,30.080132],tit:"牟山镇"},
		"丈亭镇":{position:[121.2962,30.038675],tit:"丈亭镇"},
		"泗门镇":{position:[121.048312,30.165408],tit:"泗门镇"},
		"临山镇":{position:[120.995497,30.159905],tit:"临山镇"},
		"陆埠镇":{position:[121.247522,29.994744],tit:"陆埠镇"},
		"大隐镇":{position:[121.381209,29.946947],tit:"大隐镇"},
		"梁弄镇":{position:[121.082551,29.917411],tit:"梁弄镇"},
		"大岚镇":{position:[121.136016,29.826857],tit:"大岚镇"},
		"鹿亭乡":{position:[121.211223,29.883062],tit:"鹿亭乡"},
		"凤山街道":{position:[121.188687,30.072629],tit:"凤山街道"},
		"阳明街道":{position:[121.146961,30.04944],tit:"阳明街道"},
		"梨洲街道":{position:[121.167142,30.045013],tit:"梨洲街道"},
		"兰江街道":{position:[121.122102,30.026225],tit:"兰江街道"},
		"低塘街道":{position:[121.157651,30.169039],tit:"低塘街道"},
		"朗霞街道":{position:[121.088516,30.174006],tit:"朗霞街道"},
		"三七市镇":{position:[121.351934,30.030782],tit:"三七市镇"},
		"河姆渡镇":{position:[121.320847,29.99549],tit:"河姆渡镇"},
		"小曹娥镇":{position:[121.080433,30.223577],tit:"小曹娥镇"},
		"黄家埠镇":{position:[120.97312,30.131177],tit:"黄家埠镇"},
		"四明山镇":{position:[121.126022,29.742046],tit:"四明山镇"},
		"经济开发区":{position:[121.176347,30.014258],tit:"经济开发区"},
		"余姚市科协":{position:[121.141146,30.036596],tit:"余姚市科协"}
	},
	"慈溪市":{
		"宗汉街道":{position:[121.242855,30.20331],tit:"宗汉街道"},
		"坎墩街道":{position:[121.267276,30.224202],tit:"坎墩街道"},
		"古塘街道":{position:[121.269317,30.17817],tit:"古塘街道"},
		"观海卫镇":{position:[121.413178,30.173549],tit:"观海卫镇"},
		"白沙路街道":{position:[121.294856,30.173104],tit:"白沙路街道"},
		"杭州湾新区":{position:[121.329137,30.299062],tit:"杭州湾新区"},
		"龙山镇":{position:[121.489324,30.107836],tit:"龙山镇"},
		"掌起镇":{position:[121.462472,30.123556],tit:"掌起镇"},
		"附海镇":{position:[121.405648,30.227583],tit:"附海镇"},
		"桥头镇":{position:[121.364909,30.165402],tit:"桥头镇"},
		"匡堰镇":{position:[121.311115,30.162614],tit:"匡堰镇"},
		"逍林镇":{position:[121.328719,30.181512],tit:"逍林镇"},
		"新浦镇":{position:[121.374039,30.25231],tit:"新浦镇"},
		"胜山镇":{position:[121.336306,30.240135],tit:"胜山镇"},
		"横河镇":{position:[121.249214,30.136389],tit:"横河镇"},
		"崇寿镇":{position:[121.27811,30.27536],tit:"崇寿镇"},
		"庵东镇":{position:[121.225313,30.275015],tit:"庵东镇"},
		"天元镇":{position:[121.185603,30.196915],tit:"天元镇"},
		"长河镇":{position:[121.186422,30.230897],tit:"长河镇"},
		"周巷镇":{position:[121.14265,30.191773],tit:"周巷镇"},
		"浒山街道":{position:[121.244881,30.17155],tit:"浒山街道"}
	}
};
var allJiedao = {
	//慈溪
	"宗汉街道":{ 
    	"百两村办公楼": { position: [121.219449,30.202648], tit: "百两村办公楼" },
        "百兴村办公楼": { position: [121.199358,30.194723], tit: "百兴村办公楼" }, 
        "街道办事处": { position: [121.234361,30.19083], tit: "街道办事处" }, 
        "潮塘村办公楼": { position: [121.226346,30.221748], tit: "潮塘村办公楼" }, 
        "二塘新村办公楼": { position: [121.228028,30.231961], tit: "二塘新村办公楼" }, 
        "桃源江社区居委会": { position: [121.210598,30.215882], tit: "桃源江社区居委会" }, 
        "高王村办公楼": { position: [121.210598,30.225882], tit: "高王村办公楼" }, 
        "江东村办公楼": { position: [121.227175,30.204539], tit: "江东村办公楼" }, 
        "金堂村办公楼": { position: [121.206224,30.215277], tit: "金堂村办公楼" }, 
		"星光社区居委会": { position: [121.24089,30.210678], tit: "星光社区居委会" },
		"联兴村办公楼": { position: [121.205023,30.20329], tit: "联兴村办公楼" }, 
        "马家路村办公楼": { position: [121.237708,30.19428], tit: "马家路村办公楼" }, 
        "庙山村办公楼": { position: [121.227527,30.187559], tit: "庙山村办公楼" }, 
		"曙光社区居委会": { position: [121.242985,30.203235], tit: "曙光社区居委会" },
		"新华村办公楼": { position: [121.239176,30.197931], tit: "新华村办公楼" }, 
        "新界村办公楼": { position: [121.234361,30.19083], tit: "新界村办公楼" }, 
        "新塘村办公楼": { position: [121.238763,30.189733], tit: "新塘村办公楼" }, 
		"怡园村办公楼": { position: [121.217325,30.21921], tit: "怡园村办公楼" },
		"周塘西村办公楼": { position: [121.238763,30.189733], tit: "周塘西村办公楼" }
	},

	"浒山街道":{ 
		"天香桥村委会": { position: [121.267066,30.151846], tit: "天香桥村委会" },
		"光辉社区居委会": { position: [121.268648,30.17722], tit: "光辉社区居委会" },
		"东山社区居委会": { position: [121.260325,30.166288], tit: "东山社区居委会" },
		"古塘社区居委会": { position: [121.245803,30.178084], tit: "古塘社区居委会" },
		"剑山社区居委会": { position: [121.252799,30.161352], tit: "剑山社区居委会" },
		"金山社区居委会": { position: [121.254045,30.171976], tit: "金山社区居委会" },
		"金东社区居委会": { position: [121.258714,30.168747], tit: "金东社区居委会" },
		"阳明社区居委会": { position: [121.239128,30.167806], tit: "阳明社区居委会" },
		"楼家社区居委会": { position: [121.2608,30.17764], tit: "楼家社区居委会" },
		"东海社区居委会": { position: [121.238077,30.172418], tit: "东海社区居委会" },
		"新江路社区居委会": { position: [121.241534,30.168166], tit: "新江路社区居委会" },
		"南孙塘社区居委会": { position: [121.260325,30.166288], tit: "南孙塘社区居委会" },
		"虞波社区居委会": { position: [121.267014,30.165947], tit: "虞波社区居委会" },
		"金南社区居委会": { position: [121.25868,30.164611], tit: "金南社区居委会" },
		"孙塘社区居委会": { position: [121.264036,30.179042], tit: "孙塘社区居委会" },
		"浒西社区居委会": { position: [121.242303,30.176009], tit: "浒西社区居委会" },
		"水南社区居委会": { position: [121.25415,30.174983], tit: "水南社区居委会" },
		"湾底社区居委会": { position: [121.234924,30.172838], tit: "湾底社区居委会" },
		"上叶家社区居委会": { position: [121.256653,30.170568], tit: "上叶家社区居委会" },
		"眉山社区居委会": { position: [121.23329,30.177871], tit: "眉山社区居委会" },
		"鸣山社区居委会": { position: [121.238747,30.1797], tit: "鸣山社区居委会" },
		"三碰桥社区居委会": { position: [121.238406,30.178286], tit: "三碰桥社区居委会" },
		"施山社区居委会": { position: [121.241593,30.16851], tit: "施山社区居委会" },
		"东门社区居委会": { position: [121.258025,30.178389], tit: "东门社区居委会" },
		"寺山路社区居委会": { position: [121.24513,30.169394], tit: "寺山路社区居委会" },
		"虞家路社区居委会": { position: [121.254045,30.171976], tit: "虞家路社区居委会" },
		"明珠社区居委会": { position: [121.605557,29.895854], tit: "明珠社区居委会" }
		
	
	
	},

	"周巷镇":{ 
		"蔡家社区居委会": { position: [121.140036,30.180208], tit: "蔡家社区居委会" },
		"城中村委会": { position: [121.15013,30.191391], tit: "城中村委会" },
		"大古塘村委会": { position: [121.169104,30.17592], tit: "大古塘村委会" },
		"登州街村委会": { position: [121.123066,30.255502], tit: "登州街村委会" },
		"东河社区居委会": { position: [121.14369,30.227606], tit: "东河社区居委会" },
		"二塘村委会": { position: [121.14369,30.217606], tit: "二塘村委会" },
		"海江村委会": { position: [121.150741,30.258327], tit: "海江村委会" },
		"海莫社区居委会": { position: [121.134479,30.184913], tit: "海莫社区居委会" },
		"湖塘新村委会": { position: [121.135932,30.195104], tit: "湖塘新村委会" },
		"花墙门社区居委会": { position: [121.135306,30.174632], tit: "花墙门社区居委会" },
		"建五村委会": { position: [121.153458,30.277371], tit: "建五村委会" },
		"界塘村委会": { position: [121.160705,30.1986468], tit: "界塘村委会" },
		"路湾村委会": { position: [121.156261,30.269539], tit: "路湾村委会" },
		"劳家埭村委会": { position: [121.153301,30.24259], tit: "劳家埭村委会" },
		"平王社区居委会": { position: [121.140701,30.184172], tit: "平王社区居委会" },
		"三江口村委会": { position: [121.116671,30.238956], tit: "三江口村委会" },
		"省塘头村委会": { position: [121.184838,30.181677], tit: "省塘头村委会" },
		"十甲村委会": { position: [121.196887,30.214639], tit: "十甲村委会" },
		"双东村委会": { position: [121.202573,30.203776], tit: "双东村委会" },
		"双乐村委会": { position: [121.11184,30.187228], tit: "双乐村委会" },
		"双潭村委会": { position: [121.088187,30.251368], tit: "双潭村委会" },
		"潭北村委会": { position: [121.193121,30.229465], tit: "潭北村委会" },
		"潭东村委会": { position: [121.189478,30.191539], tit: "潭东村委会" },
		"潭河村委会": { position: [121.193121,30.219465], tit: "潭河村委会" },
		"天灯舍村委会": { position: [121.134891,30.268383], tit: "天灯舍村委会" },
		"天潭村委会": { position: [121.182294,30.195239], tit: "天潭村委会" },
		"万安庄村委会": { position: [121.153285,30.20921], tit: "万安庄村委会" },
		"万寿寺村委会": { position: [121.141744,30.201045], tit: "万寿寺村委会" },
		"西三村委会": { position: [121.126697,30.267859], tit: "西三村委会" },
		"下吴家路村委会": { position: [121.138681,30.200312], tit: "下吴家路村委会" },
		//"小安村委会": { position: [121.136751,30.255613], tit: "小安村委会" },
		"新潮村委会": { position: [121.125413,30.212677], tit: "新潮村委会" },
		"新缪路村委会": { position: [121.118141,30.206284], tit: "新缪路村委会" },
		"兴柴村委会": { position: [121.201832,30.212324], tit: "兴柴村委会" },
		"元甲村委会": { position: [121.194456,30.215165], tit: "元甲村委会" },
		"云城村委会": { position: [121.167724,30.192407], tit: "云城村委会" },
		"长胜市村委会": { position: [121.165676,30.260525], tit: "长胜市村委会" },
		"镇东新村委会": { position: [121.162227,30.184543], tit: "镇东新村委会" },
		"镇政府": { position: [121.146927,30.23707], tit: "镇政府" },
		"周邵村委会": { position: [121.187317,30.253158], tit: "周邵村委会" },
		"周西社区居委会": { position: [121.127555,30.180085], tit: "周西社区居委会" }	
	},
	"长河镇":{ 
		"沧南村委会": { position: [121.187317,30.253158], tit: "沧南村委会" },
		"沧田村委会": { position: [121.207227,30.268588], tit: "沧田村委会" },
		"大牌头村委会": { position: [121.189098,30.261848], tit: "大牌头村委会" },
		"大云村委会": { position: [121.180666,30.263593], tit: "大云村委会" },
		//修改
		"垫桥村委会": { position: [121.166357,30.220601], tit: "垫桥村委会" },
		"高兴村委会": { position: [121.195983,30.268466], tit: "高兴村委会" },
		"宁丰村委会": { position: [121.1862,30.229425], tit: "宁丰村委会" },
		"贤江村委会": { position: [121.172365,30.218869], tit: "贤江村委会" }
	
	
	},
	"崇寿镇":{ 
		"崇胜村委会": { position: [121.28459,30.276094], tit: "崇胜村委会" },
		"傅福村委会": { position: [121.251147,30.270897], tit: "傅福村委会" },
		"傅家路村委会": { position: [121.260044,30.271493], tit: "傅家路村委会" },
		"海运村委会": { position: [121.310957,30.274816], tit: "海运村委会" },
		"健民村委会": { position: [121.244645,30.275705], tit: "健民村委会" },
		"六塘村委会": { position: [121.277433,30.27844], tit: "六塘村委会" },
		"四灶浦村委会": { position: [121.319703,30.292507], tit: "四灶浦村委会" },
	
		"相公殿村委会": { position: [121.302101,30.274325], tit: "相公殿村委会" },
		"镇政府": { position: [121.319703,30.282507], tit: "镇政府" }
	
	},
	"横河镇":{ 
		"大山村委会": { position: [121.290719,30.085165], tit: "大山村委会" },
		"东畈村委会": { position: [121.267248,30.133478], tit: "东畈村委会" },
		"龙南村委会": { position: [121.262422,30.117546], tit: "龙南村委会" },
		"龙泉村委会": { position: [121.243486,30.133124], tit: "龙泉村委会" },
		"梅湖村委会": { position: [121.240932,30.098826], tit: "梅湖村委会" },
		"梅园村委会": { position: [121.278026,30.111541], tit: "梅园村委会" },
		"彭南村委会": { position: [121.281726,30.137987], tit: "彭南村委会" },
		"秦堰村委会": { position: [121.231632,30.127607], tit: "秦堰村委会" },
		"上剑山村委会": { position: [121.245569,30.157551], tit: "上剑山村委会" },
		"石堰村委会": { position: [121.210796,30.120453], tit: "石堰村委会" },
		"童岙村委会": { position: [121.222742,30.091215], tit: "童岙村委会" },
		"乌玉桥村委会": { position: [121.192531,30.119694], tit: "乌玉桥村委会" },
		"伍梅村委会": { position: [121.245981,30.124418], tit: "伍梅村委会" },
		"相士地村委会": { position: [121.258644,30.150007], tit: "相士地村委会" },
		"洋山岗村委会": { position: [121.234306,30.14417], tit: "洋山岗村委会" },
		"宜青桥村委会": { position: [121.258155,30.154856], tit: "宜青桥村委会" },
		"子陵村委会": { position: [121.197973,30.109136], tit: "子陵村委会" }
	},
	"胜山镇":{ 
		"大湾村委会": { position: [121.318508,30.237721], tit: "大湾村委会" },
		"二灶村委会": { position: [121.315595,30.246313], tit: "二灶村委会" },
		"三灶村委会": { position: [121.312067,30.249857], tit: "三灶村委会" },
		"上蔡村委会": { position: [121.344033,30.233778], tit: "上蔡村委会" },
		"胜东村委会": { position: [121.337984,30.234495], tit: "胜东村委会" },
		"胜南村委会": { position: [121.311348,30.222733], tit: "胜南村委会" },
		"胜山头村委会": { position: [121.324181,30.237179], tit: "胜山头村委会" },
		"胜西村委会": { position: [121.308808,30.251905], tit: "胜西村委会" },
		//修改
		"四灶村委会": { position: [121.306873,30.242721], tit: "四灶村委会" },
		"镇前村委会": { position: [121.334439,30.247125], tit: "镇前村委会" }
		   
	},
	"新浦镇":{ 
		"老浦村委会": { position: [121.373739,30.245057], tit: "老浦村委会" },
		"六塘南村委会": { position: [121.355184,30.268877], tit: "六塘南村委会" },
		"荣誉村委会": { position: [121.351978,30.255742], tit: "荣誉村委会" },
		"上舍村委会": { position: [121.386102,30.235554], tit: "上舍村委会" },
		"双庆浦村委会": { position: [121.378291,30.231054], tit: "双庆浦村委会" },
		"水湘村委会": { position: [121.372438,30.246884], tit: "水湘村委会" },
		"五塘南村委会": { position: [121.323147,30.261068], tit: "五塘南村委会" },
		"西街村委会": { position: [121.36742,30.247195], tit: "西街村委会" },
		"下洋浦村委会": { position: [121.429149,30.250385], tit: "下洋浦村委会" },
		"新闸村委会": { position: [121.400087,30.267787], tit: "新闸村委会" },
		"洋龙村委会": { position: [121.395383,30.237082], tit: "洋龙村委会" },
		"腰塘村委会": { position: [121.380436,30.27418], tit: "腰塘村委会" },
		"余家路村委会": { position: [121.38088,30.239463], tit: "余家路村委会" },
		"镇政府": { position: [121.374321,30.252149], tit: "镇政府" }	     
	},

	"匡堰镇":{ 
		"倡隆村委会": { position: [121.312147,30.126417], tit: "倡隆村委会" },
		"岗墩村委会": { position: [121.311361,30.082288], tit: "岗墩村委会" },
		"龙舌村委会": { position: [121.303595,30.154661], tit: "龙舌村委会" },
		"乾炳村委会": { position: [121.308354,30.109637], tit: "乾炳村委会" },
		"石人山村委会": { position: [121.317057,30.15365], tit: "石人山村委会" },
		"王家埭村委会": { position: [121.339115,30.160368], tit: "王家埭村委会" }
		     
	},
	"逍林镇":{ 
		"福合院村委会": { position: [121.329504,30.192548], tit: "福合院村委会" },
		"宏跃村委会": { position: [121.328141,30.186473], tit: "宏跃村委会" },
		"林西村委会": { position: [121.314669,30.183095], tit: "林西村委会" },
		"桥一村委会": { position: [121.335844,30.179522], tit: "桥一村委会" },
		"水云浦村委会": { position: [121.353163,30.244513], tit: "水云浦村委会" },
		"逍路沿村委会": { position: [121.33864,30.194129], tit: "逍路沿村委会" },
		"新园村委会": { position: [121.31705,30.176044], tit: "新园村委会" },
		"振兴村委会": { position: [121.343971,30.184839], tit: "振兴村委会" }
	
		     
	},
	"桥头镇":{ 
		"丰潭村委会": { position: [121.357118,30.183241], tit: "丰潭村委会" },
		"毛三斢村委会": { position: [121.378758,30.179917], tit: "毛三斢村委会" },
		"上林湖村委会": { position: [121.342247,30.148451], tit: "上林湖村委会" },
		"潭河沿村委会": { position: [121.361624,30.185535], tit: "潭河沿村委会" },
		"五丰村委会": { position: [121.350868,30.182936], tit: "五丰村委会" },
		"小桥头村委会": { position: [121.366252,30.162259], tit: "小桥头村委会" },
		"烟墩村委会": { position: [121.383124,30.164373], tit: "烟墩村委会" }      
	},
	"附海镇":{ 
		//东港村修改
		"东港村委会": { position: [121.417587,30.229853], tit: "东港村委会" },
		"东海村委会": { position: [121.400957,30.22129], tit: "东海村委会" },
		"海晏庙村委会": { position: [121.414676,30.231467], tit: "海晏庙村委会" },
		"花木村委会": { position: [121.420901,30.22284], tit: "花木村委会" },
		"花塘村委会": { position: [121.396502,30.232929], tit: "花塘村委会" },
		"南圆村委会": { position: [121.394087,30.204279], tit: "南圆村委会" },
		"四界村委会": { position: [121.388261,30.218022], tit: "四界村委会" },
		"镇政府": { position: [121.405648,30.227583], tit: "镇政府" }
       
	},

	"掌起镇":{ 
		"巴里村委会": { position: [121.442044,30.140572], tit: "巴里村委会" },
		"柴家村委会": { position: [121.441424,30.137282], tit: "柴家村委会" },
		"陈家村委会": { position: [121.459474,30.120662], tit: "陈家村委会" },
		"古窑浦村委会": { position: [121.503389,30.153716], tit: "古窑浦村委会" },
		"鹤凤村委会": { position: [121.448982,30.104827], tit: "鹤凤村委会" },
		"洪魏村委会": { position: [121.435714,30.097846], tit: "洪魏村委会" },
		"厉家村委会": { position: [121.453471,30.122438], tit: "厉家村委会" },
		"裘家村委会": { position: [121.443326,30.138597], tit: "裘家村委会" },
		"任佳溪村委会": { position: [121.456279,30.079693], tit: "任佳溪村委会" },
		"戎家村委会": { position: [121.451715,30.12897], tit: "戎家村委会" },
		"五姓点村委会": { position: [121.469024,30.113715], tit: "五姓点村委会" },
		"叶家村委会": { position: [121.46879,30.119546], tit: "叶家村委会" },
		"长溪村委会": { position: [121.437448,30.069669], tit: "长溪村委会" },
		"周家段村委会": { position: [121.448846,30.132876], tit: "周家段村委会" }
        
	},

	"白沙路街道":{ 
		"白沙街道办事处": { position: [121.295705,30.173899], tit: "白沙街道办事处" },
		"八字桥村": { position: [121.283234,30.16785], tit: "八字桥村" },
		"白果树社区居委会": { position: [121.27479,30.177711], tit: "白果树社区居委会" },
		"白河社区居委会": { position: [121.284687,30.18403], tit: "白河社区居委会" },
		"白沙路村": { position: [121.280391,30.172066], tit: "白沙路村" },
		"二房村": { position: [121.286332,30.162328], tit: "二房村" },
		"高河塘村": { position: [121.306313,30.18298], tit: "高河塘村" },
		"河角村": { position: [121.289299,30.190424], tit: "河角村" },
		"宏坚村": { position: [121.280399,30.162293], tit: "宏坚村" },
		"赖王村": { position: [121.284743,30.17814], tit: "赖王村" },
		"隆兴村": { position: [121.279847,30.163604], tit: "隆兴村" },
		"潘余村": { position: [121.29131,30.168456], tit: "潘余村" },
		"墙里村": { position: [121.294297,30.189007], tit: "墙里村" },
		"群丰社区居委会": { position: [121.272136,30.169813], tit: "群丰社区居委会" },
		"三洞桥村": { position: [121.285495,30.1905], tit: "三洞桥村" },
		"上周塘村": { position: [121.276795,30.186176], tit: "上周塘村" },
		"武陵桥村": { position: [121.297419,30.165575], tit: "武陵桥村" },
		"西华头村": { position: [121.300765,30.185875], tit: "西华头村" },
		"新横江村": { position: [121.293672,30.16129], tit: "新横江村" },
		"长春村": { position: [121.288164,30.167848], tit: "长春村" }
        
	},

	"龙山镇":{ 
		"达蓬村委会": { position: [121.518554,30.09673], tit: "达蓬村委会" },
		"东渡村委会": { position: [121.502381,30.099776], tit: "东渡村委会" },
		"东门外村委会": { position: [121.568117,30.075864], tit: "东门外村委会" },
		"伏龙山村委会": { position: [121.565632,30.10408], tit: "伏龙山村委会" },
		"海甸戎村委会": { position: [121.501417,30.104924], tit: "海甸戎村委会" },
		"黄杨岙村委会": { position: [121.502171,30.080645], tit: "黄杨岙村委会" },
		"金岙村委会": { position: [121.58803,30.058487], tit: "金岙村委会" },
		"筋竹村委会": { position: [121.530735,30.094149], tit: "筋竹村委会" },
		"龙头场村委会": { position: [121.546954,30.090297], tit: "龙头场村委会" },
		"潘岙村委会": { position: [121.479764,30.077706], tit: "潘岙村委会" },
		"邱王村委会": { position: [121.578941,30.069057], tit: "邱王村委会" },
		"山下村委会": { position: [121.560351,30.093077], tit: "山下村委会" },
		"施公山村委会": { position: [121.512077,30.099046], tit: "施公山村委会" },
		"淞浦村委会": { position: [121.479247,30.113586], tit: "淞浦村委会" },
		"太平闸村委会": { position: [121.513809,30.143151], tit: "太平闸村委会" },
		//修改
		"田央村委会": { position: [121.52538,30.094044], tit: "田央村委会" },
		"王家路村委会": { position: [121.485204,30.106501], tit: "王家路村委会" },
		"西门外村委会": { position: [121.532382,30.132873], tit: "西门外村委会" },
		"小施山村委会": { position: [121.219449,30.202648], tit: "小施山村委会" },
		"新东村委会": { position: [121.470119,30.093415], tit: "新东村委会" },
		"新联村委会": { position: [121.529935,30.113651], tit: "新联村委会" },
		"新西村委会": { position: [121.478465,30.109872], tit: "新西村委会" },
		"徐福村委会": { position: [121.52318,30.08973], tit: "徐福村委会" },
		"镇政府": { position: [121.489324,30.107836], tit: "镇政府" }

      
	},

	"坎墩街道":{ 
    	"街道办事处": { position: [121.265525,30.221405], tit: "街道办事处" },
        "坎东村委会": { position: [121.284155,30.217118], tit: "坎东村委会" }, 
        "二灶市村委会": { position: [121.279254,30.22381], tit: "二灶市村委会" }, 
        "沈五村委会": { position: [121.268205,30.219934], tit: "沈五村委会" }, 
        "坎西村委会": { position: [121.24459,30.232404], tit: "坎西村委会" }, 
        "坎中村委会": { position: [121.264129,30.230978], tit: "坎中村委会" }, 
        "孙方村委会": { position: [121.257912,30.23009], tit: "孙方村委会" }, 
        "三群村委会": { position: [121.278803,30.219062], tit: "三群村委会" }, 
        "三四灶村委会": { position: [121.304754,30.242515], tit: "三四灶村委会" }, 
		"四塘南村委会": { position: [121.299028,30.255218], tit: "四塘南村委会" },
		"五塘新村委会": { position: [121.270539,30.265042], tit: "五塘新村委会" }, 
        "直塘村委会": { position: [121.249181,30.229304], tit: "直塘村委会" }
        
	},
	"古塘街道":{ 
    	"城北社区居委会": { position: [121.250175,30.185095], tit: "城北社区居委会" },
        "旦苑社区居委会": { position: [121.265997,30.183166], tit: "旦苑社区居委会" }, 
        "青少年宫路社区居委会": { position: [121.26039,30.180547], tit: "青少年宫路社区居委会" }, 
        "新潮塘村委会": { position: [121.25883,30.219912], tit: "新潮塘村委会" }, 
        "西洋寺社区居委会": { position: [121.262802,30.186162], tit: "西洋寺社区居委会" }, 
        "开发社区居委会": { position: [121.255955,30.187572], tit: "开发社区居委会" }, 
        "界牌村委会": { position: [121.258482,30.197167], tit: "界牌村委会" }, 
        "石桥头村委会": { position: [121.278803,30.219062], tit: "石桥头村委会" }, 
        "金桥社区居委会": { position: [121.25809,30.195501], tit: "金桥社区居委会" }, 
		"担山跟社区居委会": { position: [121.270407,30.187273], tit: "担山跟社区居委会" },
		"上傅家社区居委会": { position: [121.264759,30.194988], tit: "上傅家社区居委会" }, 
		"太屺村委会": { position: [121.276441,30.192349], tit: "太屺村委会" },
		"团圈社区居委会": { position: [121.2564,30.184008], tit: "团圈社区居委会" },
		"舒苑社区居委会": { position: [121.26624,30.180016], tit: "舒苑社区居委会" },
	
		"园丁社区居委会": { position: [121.243149,30.181996], tit: "园丁社区居委会" }        
	},
	"观海卫镇":{ 
		"白洋村委会": { position: [121.375254,30.125228], tit: "白洋村委会" },
		"昌明村委会": { position: [121.412206,30.11892], tit: "昌明村委会" },
		"昌兴村委会": { position: [121.426969,30.132152], tit: "昌兴村委会" },
		"城隍庙社区居委会": { position: [121.403024,30.18516], tit: "城隍庙社区居委会" },
		"大岐山村委会": { position: [121.472266,30.168054], tit: "大岐山村委会" },
		"东桥头村委会": { position: [121.430573,30.154046], tit: "东桥头村委会" },
		"东营村委会": { position: [121.43054,30.197548], tit: "东营村委会" },
		"洞桥村委会": { position: [121.441051,30.144501], tit: "洞桥村委会" },
		//修改
		"杜岙村委会": { position: [121.373929,30.087793], tit: "杜岙村委会" },
		"杜家桥村委会": { position: [121.398228,30.15308], tit: "杜家桥村委会" },
		"蒋家桥村委会": { position: [121.405047,30.169369], tit: "蒋家桥村委会" },
		"锦堂村委会": { position: [121.424685,30.188716], tit: "锦堂村委会" },
		"鸣兴村委会": { position: [121.39641,30.142839], tit: "鸣兴村委会" },
		"三塘头村委会": { position: [121.459662,30.173664], tit: "三塘头村委会" },
		"山海村委会": { position: [121.413128,30.173409], tit: "山海村委会" },
		"上横街村委会": { position: [121.417802,30.180556], tit: "上横街村委会" },
		"沈师桥村委会": { position: [121.434412,30.14955], tit: "沈师桥村委会" },
		"师东村委会": { position: [121.429634,30.152048], tit: "师东村委会" },
		"双湖村委会": { position: [121.389629,30.136919], tit: "双湖村委会" },
		"天妃宫村委会": { position: [121.382768,30.182056], tit: "天妃宫村委会" },
		"王叶村委会": { position: [121.409163,30.154547], tit: "王叶村委会" },
		"卫北村委会": { position: [121.414218,30.182061], tit: "卫北村委会" },
		"卫东村委会": { position: [121.417092,30.180722], tit: "卫东村委会" },
		"卫南村委会": { position: [121.41465,30.174087], tit: "卫南村委会" },
		"卫西村委会": { position: [121.409978,30.181698], tit: "卫西村委会" },
		"五洞闸村委会": { position: [121.496278,30.171313], tit: "五洞闸村委会" },
		"小团浦村委会": { position: [121.425623,30.160572], tit: "小团浦村委会" },
		"新泽村委会": { position: [121.42339,30.173912], tit: "新泽村委会" },
		"淹浦村委会": { position: [121.44073,30.146143], tit: "淹浦村委会" }
    
	},


	//海曙
    "洞桥镇":{ 
    	"前王村": { position: [121.432629,29.765248], tit: "前王村" },
        "三李村": { position: [121.413719,29.768223], tit: "三李村" }, 
        "孙王村": { position: [121.41824,29.800331], tit: "孙王村" }, 
        "宣裴村": { position: [121.398394,29.759821], tit: "宣裴村" }, 
        "周公宅": { position: [121.413095,29.787313], tit: "周公宅" }, 
        "沙港村": { position: [121.417868,29.781828], tit: "沙港村" }, 
        "惠江村": { position: [121.395722,29.771185], tit: "惠江村" }, 
        "上凌村": { position: [121.426296,29.797147], tit: "上凌村" }, 
        "鱼山头村": { position: [121.426302,29.752408], tit: "鱼山头村" }, 
        "张家垫村": { position: [121.431153,29.768194], tit: "张家垫村" } 
    },
    
    "高桥镇":{ 
    	"岐湖村": { position: [121.402384, 29.93201], tit: "岐湖村" }, 
    	"民乐村": { position: [121.403779, 29.946278], tit: "民乐村" }, 
    	"岐阳村": { position: [121.433717, 29.925413], tit: "岐阳村" }, 
    	"紫薇社区": { position: [121.510537, 29.885429], tit: "紫薇社区" }, 
    	"高桥社区": { position: [121.475142, 29.90918], tit: "高桥社区" }, 
    	"高桥镇政府": { position: [121.468441, 29.910954], tit: "高桥镇政府" } },
    "古林镇":{ 
    	"辰交村": { position: [121.438623, 29.832429], tit: "辰交村" }, 
    	"古林村": { position: [121.443476, 29.835754], tit: "古林村" }, 
    	"郭夏村": { position: [121.435317, 29.85215], tit: "郭夏村" }, 
    	"藕池村": { position: [121.514563, 29.849435], tit: "藕池村" }, 
    	"三星村": { position: [121.559458, 29.983306], tit: "三星村" }, 
    	"施家村": { position: [121.445955, 29.836333], tit: "施家村" }, 
    	"仲一村": { position: [121.429997, 29.825326], tit: "仲一村" }, 
    	"茂新村": { position: [121.407224, 29.830434], tit: "茂新村" }, 
    	"葑水港村": { position: [121.477546, 29.832382], tit: "葑水港村" }, 
    	"盛园社区": { position: [121.509787, 29.870552], tit: "盛园社区" }, 
    	"西湖社区": { position: [121.519682, 29.861441], tit: "西湖社区" }, 
    	"西洋港村": { position: [121.427321, 29.840278], tit: "西洋港村" }, 
    	"枫园社区": { position: [121.506184, 29.864818], tit: "枫园社区" } },
    "横街镇": { 
    	"林村": { position: [121.397938, 29.867803], tit: "林村" }, 
    	"东村": { position: [121.398688, 29.856927], tit: "东村" },
    	"水家村": { position: [121.407035, 29.849102], tit: "水家村" },
    	"芝岭村": { position: [121.344559, 29.851749], tit: "芝岭村" },
    	"爱岭村": { position: [121.347481, 29.897076], tit: "爱岭村" },
    	"半山村": { position: [121.343921, 29.887533], tit: "半山村" },
    	"凤林村": { position: [121.403712, 29.865589], tit: "凤林村" }, 
    	"横街村": { position: [121.405261, 29.862883], tit: "横街村" }, 
    	"惠民村": { position: [121.318585, 29.916198], tit: "惠民村" }, 
    	"雷庄村": { position: [121.401738, 29.859051], tit: "雷庄村" }, 
    	"毛岙村": { position: [121.354206, 29.867314], tit: "毛岙村" }, 
    	"盛家村": { position: [121.380159, 29.874795], tit: "盛家村" },
    	"乌岩村": { position: [121.325395, 29.902534], tit: "乌岩村" },
    	"溪下村": { position: [121.372354, 29.87141], tit: "溪下村" },
    	"应山村": { position: [121.404528, 29.875556], tit: "应山村" }, 
    	"云洲村": { position: [121.290284, 29.878839], tit: "云洲村" },
    	"朱敏村": { position: [121.324581, 29.898183], tit: "朱敏村" },
    	"芝溪村": { position: [121.349991, 29.856473], tit: "芝溪村" }, 
    	"梅梁桥村": { position: [121.389232, 29.844718], tit: "梅梁桥村" }, 
    	"新洞山村": { position: [121.345413, 29.859215], tit: "新洞山村" }, 
    	"横街镇镇政府": { position: [121.405695, 29.85974], tit: "横街镇镇政府" } 
    },
    
    "龙观乡": { 
    	"桓村": { position: [121.323263, 29.772624], tit: "桓村" },
    	"大路村": { position: [121.308555, 29.755239], tit: "大路村" }, 
    	"后隆村": { position: [121.323725, 29.789043], tit: "后隆村" },
    	"李岙村": { position: [121.288945, 29.743721], tit: "李岙村" }, 
    	"龙峰村": { position: [121.27884, 29.771764], tit: "龙峰村" },
    	"龙溪村": { position: [121.316071, 29.772693], tit: "龙溪村" }, 
    	"雪岙村": { position: [121.283405, 29.746511], tit: "雪岙村" }, 
    	"山下村": { position: [121.294857, 29.747309], tit: "山下村" } 
    },
    
    "鄞江镇":  {
    	"金陆村": { position: [121.343679, 29.755993], tit: "金陆村" }, 
    	"蓉峰村": { position: [121.37707, 29.752205], tit: "蓉峰村" },
    	"鄞江村": { position: [121.346094, 29.783009], tit: "鄞江村" }, 
    	"悬慈村": { position: [121.364124, 29.77035], tit: "悬慈村" }, 
    	"清源村": { position: [121.316621, 29.742714], tit: "清源村" },
    	"鄞江镇居民委": { position: [121.362281, 29.775333], tit: "鄞江镇居民委" }, 
    	"山水人家小区": { position: [121.363787, 29.783312], tit: "山水人家小区" } 
    }, 
    "南门街道":{ 
    	"澄浪社区": { position: [121.555009, 29.862426], tit: "澄浪社区" }, 
    	"柳锦社区": { position: [121.537, 29.875707], tit: "柳锦社区" },
    	"万安社区": { position: [121.534517, 29.880488], tit: "万安社区" },
    	"红起社区": { position: [121.548052, 29.866732], tit: "红起社区" }, 
    	"车站社区": { position: [121.538695, 29.872048], tit: "车站社区" }, 
    	"马园社区": { position: [121.543111, 29.875231], tit: "马园社区" }, 
    	"郎官社区": { position: [121.53961, 29.879218], tit: "郎官社区" }, 
    	"迎春社区": { position: [121.542583, 29.877499], tit: "迎春社区" }, 
    	"朝阳社区": { position: [121.549591, 29.865574], tit: "朝阳社区" }, 
    	"周江岸社区": { position: [121.544682, 29.86133], tit: "周江岸社区" }, 
    	"尹江岸社区": { position: [121.546645, 29.864405], tit: "尹江岸社区" } 
    },
    
     "江厦街道":{ 
    	"新街社区": { position: [121.555058,29.87566], tit: "新街社区" }, 
    	"郡庙社区": { position: [121.56284,29.871898], tit: "郡庙社区" },
    	"天封社区": { position: [121.561339,29.870388], tit: "天封社区" }
     
    },
    
    
    
    
    "西门街道": { 
    	"汪弄社区": { position: [121.542719, 29.885061], tit: "汪弄社区" },
    	"新芝社区": { position: [121.545758, 29.888719], tit: "新芝社区" }, 
    	"翠南社区": { position: [121.542505, 29.889993], tit: "翠南社区" },
    	"北郊社区": { position: [121.547435, 29.893223], tit: "北郊社区" },
    	"文化社区": { position: [121.53764, 29.88395], tit: "文化社区" }, 
    	"龙柏社区": { position: [121.539834, 29.888862], tit: "龙柏社区" }, 
    	"柳庄社区": { position: [121.546262, 29.885079], tit: "柳庄社区" }, 
    	"永丰社区": { position: [121.547708, 29.893267], tit: "永丰社区" }, 
    	"芝红社区": { position: [121.545497, 29.89218], tit: "芝红社区" },
    	"胜丰社区": { position: [121.535928, 29.888418], tit: "胜丰社区" },
    	"翠中社区": { position: [121.538963, 29.889671], tit: "翠中社区" }, 
    	"钱东社区": { position: [121.537085, 29.893899], tit: "钱东社区" } 
    },
    "月湖街道": { 
    	"太阳社区": { position: [121.554908, 29.867057], tit: "太阳社区" },
    	"梅园社区": { position: [121.551767, 29.86729], tit: "梅园社区" },
    	"县学社区": { position: [121.552053, 29.870454], tit: "县学社区" },
    	"平桥社区": { position: [121.546458, 29.879587], tit: "平桥社区" }, 
    	"迎风社区": { position: [121.554332, 29.875115], tit: "迎风社区" } 
    },
    "鼓楼街道":{ 
    	"苍水社区": { position: [121.556772, 29.882808], tit: "苍水社区" }, 
    	"秀水社区": { position: [121.553448, 29.886704], tit: "秀水社区" }, 
    	"文昌社区": { position: [121.548401, 29.883052], tit: "文昌社区" }, 
    	"中山社区": { position: [121.554019, 29.881557], tit: "中山社区" } 
    } , 
    "白云街道": {
        "联南": { position: [121.525411, 29.873128], tit: "联南" }, 
        "丽雅": { position: [121.558034, 29.873405], tit: "丽雅" }, 
        "安泰社区": { position: [121.525075, 29.87103], tit: "安泰社区" }, 
        "安丰社区": { position: [121.518474, 29.874124], tit: "安丰社区" }, 
        "宝善社区": { position: [121.529578, 29.872566], tit: "宝善社区" }, 
        "云丰社区": { position: [121.520629, 29.877662], tit: "云丰社区" }, 
        "云乐社区": { position: [121.532003, 29.877317], tit: "云乐社区" }, 
        "牡丹社区": { position: [121.526856, 29.88261], tit: "牡丹社区" }, 
        "联北社区": { position: [121.525461, 29.874361], tit: "联北社区" },
        "南雅社区": { position: [121.530864, 29.868186], tit: "南雅社区" }, 
        "白云庄社区": { position: [121.529861, 29.879846], tit: "白云庄社区" }
        },
    "段塘街道": { 
    	"南苑社区": { position: [121.532032,29.857326], tit: "南苑社区" },
    	"南塘社区": { position: [121.535425,29.85568], tit: "南塘社区" }, 
    	"新典社区": { position: [121.534978,29.859802], tit: "新典社区" },
    	"华兴社区": { position: [121.531261,29.860555], tit: "华兴社区" },
    	"雄镇社区": { position: [121.529702,29.846822], tit: "雄镇社区" }, 
    	"南都社区": { position: [121.534821,29.863103], tit: "南都社区" },
    	"丽园社区": { position: [121.526399,29.854146], tit: "丽园社区" } 
    }, 
    "望春街道": { 
    	"徐家漕": { position: [121.522309, 29.895416], tit: "徐家漕" }, 
    	"西成社区": { position: [121.521649, 29.889039], tit: "西成社区" }, 
    	"信谊社区": { position: [121.50962, 29.886965], tit: "信谊社区" }, 
    	"清风社区": { position: [121.525363, 29.905535], tit: "清风社区" },
    	"天一家园社区": { position: [121.525788, 29.885015], tit: "天一家园社区" } 
    },
    "石碶街道": { 
    	"东杨村": { position: [121.457557, 29.805641], tit: "东杨村" },
    	"横涨村": { position: [121.453276, 29.795227], tit: "横涨村" },
    	"黄隘村": { position: [121.504548, 29.809889], tit: "黄隘村" },
    	"联丰村": { position: [121.498414, 29.809387], tit: "联丰村" }, 
    	"西杨村": { position: [121.449306, 29.807312], tit: "西杨村" }, 
    	"冯家村": { position: [121.499718, 29.82935], tit: "冯家村" },
    	"后仓村": { position: [121.491874, 29.830019], tit: "后仓村" }, 
    	"上王村": { position: [121.434204, 29.804546], tit: "上王村" }, 
    	"塘西村": { position: [121.514304, 29.837037], tit: "塘西村" },
    	"建庄村": { position: [121.513901, 29.821156], tit: "建庄村" }, 
    	"车何渡村": { position: [121.476011, 29.805966], tit: "车何渡村" }, 
    	"丽州社区": { position: [121.502504, 29.827063], tit: "丽州社区" },
    	"石锲社区": { position: [121.509496, 29.827049], tit: "石锲社区" },
    	"新区社区": { position: [121.515273, 29.83416], tit: "新区社区" },
    	"广博集团": { position: [121.472239, 29.800218], tit: "广博集团" }, 
    	"星箭航天": { position: [121.450853, 29.802009], tit: "星箭航天" }, 
    	"广博科技园": { position: [121.4724, 29.801260], tit: "广博科技园" }, 
    	"石碶街道办事处": { position: [121.514779, 29.834542], tit: "石碶街道办事处" }, 
    	"东方社区香梅家园": { position: [121.50808, 29.833796], tit: "东方社区香梅家园" } 
    }, 
    "集仕港镇": {
    	"广昇村": { position: [121.430439, 29.884233], tit: "广昇村" },
    	"岳童村": { position: [121.43475, 29.893373], tit: "岳童村" } 
    },
   
    
    
    //江北
    "慈城镇": { 
    	"北门村": { position: [121.456139, 29.990747], tit: "北门村" }, 
    	"慈湖村": { position: [121.458106, 30.000748], tit: "慈湖村" },
    	"东门村": { position: [121.461165, 29.984173], tit: "东门村" }, 
    	"东山村": { position: [121.467547, 29.992309], tit: "东山村" },
    	"东镇村": { position: [121.456085, 29.990767], tit: "东镇村" }, 
    	"公有村": { position: [121.459972, 30.047675], tit: "公有村" }, 
    	"观庄村": { position: [121.490786, 29.973139], tit: "观庄村" }, 
    	"龚冯村": { position: [121.393203, 29.984692], tit: "龚冯村" }, 
    	"国庆村": { position: [121.435856, 29.992089], tit: "国庆村" }, 
    	"洪陈村": { position: [121.415148, 29.958313], tit: "洪陈村" },
    	"虹星村": { position: [121.435354, 29.957554], tit: "虹星村" }, 
    	"湖心村": { position: [121.484295, 29.98575], tit: "湖心村" }, 
    	"黄山村": { position: [121.411724, 29.978281], tit: "黄山村" }, 
    	"金沙村": { position: [121.471834, 30.051181], tit: "金沙村" }, 
    	"毛力村": { position: [121.489403, 30.005844], tit: "毛力村" }, 
    	"妙山村": { position: [121.436796, 30.009262], tit: "妙山村" },
    	"民丰村": { position: [121.414292, 29.992827], tit: "民丰村" }, 
    	"南联村": { position: [121.442242, 30.044979], tit: "南联村" }, 
    	"前洋村": { position: [121.447317, 29.950526], tit: "前洋村" }, 
    	"勤丰村": { position: [121.456106, 29.99071], tit: "勤丰村" }, 
    	"三勤村": { position: [121.389541, 29.966074], tit: "三勤村" },
    	"五湖村": { position: [121.447384, 30.021092], tit: "五湖村" }, 
    	"新华村": { position: [121.440808, 29.969651], tit: "新华村" }, 
    	"杨陈村": { position: [121.427553, 29.968296], tit: "杨陈村" }, 
    	"上岙村": { position: [121.469581, 30.003585], tit: "上岙村" }, 
    	"三联村": { position: [121.430144, 30.003253], tit: "三联村" }, 
    	"五联村": { position: [121.458358, 30.036724], tit: "五联村" }, 
    	"五星村": { position: [121.417799, 30.01818], tit: "五星村" }, 
    	"向上村": { position: [121.410916, 30.005913], tit: "向上村" }, 
    	"白米湾村": { position: [121.486149, 29.968094], tit: "白米湾村" }, 
    	"古巷社区": { position: [121.458875, 29.988223], tit: "古巷社区" }, 
    	"景明社区": { position: [121.452835, 29.988978], tit: "景明社区" }, 
    	"双顶山村": { position: [121.414904, 29.976977], tit: "双顶山村" }, 
    	"王家坝村": { position: [121.400868, 29.959554], tit: "王家坝村" }, 
    	"望京社区": { position: [121.454921, 29.992561], tit: "望京社区" }, 
    	"浮碧社区": { position: [121.457118, 29.992596], tit: "浮碧社区" }, 
    	"宝峰社区": { position: [121.439307, 29.994866], tit: "宝峰社区" }, 
   		"慈湖人家社区": { position: [121.473478, 29.977887], tit: "慈湖人家社区" } 
    }, 
    
    "中马街道": { 
    	"浮石社区": { position: [121.558227, 29.89572], tit: "浮石社区" }, 
    	"新马社区": { position: [121.560273, 29.894058], tit: "新马社区" },
    	"槐树社区": { position: [121.559535, 29.890704], tit: "槐树社区" },
    	"盐仓社区": { position: [121.560386, 29.889033], tit: "盐仓社区" }, 
    	"外滩社区": { position: [121.565777, 29.884209], tit: "外滩社区" }
    	}, 
    "白沙街道": { 
    	"白沙社区": { position: [121.57139, 29.892023], tit: "白沙社区" }, 
    	"大庆社区": { position: [121.571157, 29.894508], tit: "大庆社区" }
    	}, 
    "孔浦街道": { 
    	"压赛村": { position: [121.577621, 29.917239], tit: "压赛村" }, 
    	"绿梅社区": { position: [121.593686, 29.908893], tit: "绿梅社区" },
    	"白杨社区": { position: [121.607453, 29.914149], tit: "白杨社区" },
    	"百合社区": { position: [121.576049, 29.906349], tit: "百合社区" }, 
    	"怡江社区": { position: [121.604978, 29.906478], tit: "怡江社区" },
    "孔浦二村社区": { position: [121.597158, 29.90803], tit: "孔浦二村社区" } 
    },
    "甬江街道": { 
    	"河东村": { position: [121.605489, 29.923323], tit: "河东村" },
    	"河西村": { position: [121.602551, 29.926263], tit: "河西村" }, 
    	"外漕村": { position: [121.586646, 29.932759], tit: "外漕村" }, 
    	"夏家村": { position: [121.60344, 29.930705], tit: "夏家村" }, 
    	"畈里塘村": { position: [121.602473, 29.939094], tit: "畈里塘村" },
    	"梅堰社区": { position: [121.603328, 29.927654], tit: "梅堰社区" },
    	"文竹社区": { position: [121.648606, 29.913731], tit: "文竹社区" }, 
    	"甬城学校": { position: [121.605307, 29.941023], tit: "甬城学校" } 
    },
    "洪塘街道": { 
    	"鞍山村": { position: [121.519109, 29.981786], tit: "鞍山村" },
    	"横山村": { position: [121.465244, 29.94428], tit: "横山村" },
    	"上沈村": { position: [121.522985, 29.96517], tit: "上沈村" }, 
    	"下沈村": { position: [121.525673, 29.943445], tit: "下沈村" }, 
    	"朱界村": { position: [121.485695, 29.922871], tit: "朱界村" }, 
    	"西江村": { position: [121.473588, 29.931593], tit: "西江村" }, 
    	"周陈村": { position: [121.517295, 29.969846], tit: "周陈村" },
    	"洪塘社区": { position: [121.517529, 29.950864], tit: "洪塘社区" }, 
    	"宁沁社区": { position: [121.50815, 29.940832], tit: "宁沁社区" }, 
    	"邵家渡村": { position: [121.483978, 29.918509], tit: "邵家渡村" },
    	"姚江社区": { position: [121.51403, 29.941696], tit: "姚江社区" } 
    }, 
    "庄桥街道": { 
    	"冯家村": { position: [121.548885, 29.930146], tit: "冯家村" }, 
    	"葛家村": { position: [121.556305, 29.938167], tit: "葛家村" }, 
    	"河西村": { position: [121.558148, 29.936626], tit: "河西村" }, 
    	"联群村": { position: [121.561446, 29.968705], tit: "联群村" }, 
    	"马径村": { position: [121.577094, 29.941339], tit: "马径村" }, 
    	"上邵村": { position: [121.535275, 29.952475], tit: "上邵村" }, 
    	"姚家村": { position: [121.565006, 29.954784], tit: "姚家村" }, 
    	"东邵村": { position: [121.541012, 29.944768], tit: "东邵村" }, 
    	"灵山村": { position: [121.535233, 29.986507], tit: "灵山村" }, 
    	"洪家村": { position: [121.55884, 29.952529], tit: "洪家村" }, 
    	"童家村": { position: [121.574791, 29.956972], tit: "童家村" },
    	"广夏社区": { position: [121.524434, 29.921065], tit: "广夏社区" },
    	"广庭社区": { position: [121.524434,29.921065], tit: "广庭社区" },
    	"天合社区": { position: [121.548946, 29.919275], tit: "天合社区" }, 
    	"天水社区": { position: [121.549158, 29.913787], tit: "天水社区" }, 
    	"天沁家园": { position: [121.553197, 29.926898], tit: "天沁家园" } 
    },
    "文教街道": { 
    	"双东坊": { position: [121.537396, 29.898789], tit: "双东坊" },
    	"育才社区": { position: [121.547028, 29.905294], tit: "育才社区" },
    	"大闸社区": { position: [121.557186, 29.900931], tit: "大闸社区" }, 
    	"繁景社区": { position: [121.541786, 29.897606], tit: "繁景社区" },
    	"翠东社区": { position: [121.540023, 29.901078], tit: "翠东社区" },
    	"范江岸社区": { position: [121.547099, 29.898972], tit: "范江岸社区" } 
    }, 
    "横溪镇": { 
    	"梅溪村": { position: [121.609717, 29.724165], tit: "梅溪村" },
    	"金山村": { position: [121.655254, 29.681806], tit: "金山村" }, 
    	"梅福村": { position: [121.603065, 29.725068], tit: "梅福村" }, 
    	"梅岭村": { position: [121.661849, 29.666943], tit: "梅岭村" }, 
    	//"梅山村": { position: [121.606397, 29.729315], tit: "梅山村" }, 
    	"横溪村": { position: [121.60103, 29.726405], tit: "横溪村" },
    	//"吴徐村": { position: [121.637241, 29.688399], tit: "吴徐村" },
    	"杨山村": { position: [121.628021, 29.656526], tit: "杨山村" }, 
    	//"周夹村": { position: [121.611654, 29.724849], tit: "周夹村" }, 
    	"金溪村": { position: [121.604437, 29.730766], tit: "金溪村" }, 
    	"镇政府": { position: [121.601946, 29.735108], tit: "镇政府" } 
    }, 
    "邱隘镇": { 
    	"回龙村": { position: [121.635719, 29.829329], tit: "回龙村" }, 
    	//"汇头村": { position: [121.657684, 29.836547], tit: "汇头村" }, 
    	//"后殷村": { position: [121.621608, 29.847522], tit: "后殷村" }, 
    	//"前殷村": { position: [121.619861, 29.840334], tit: "前殷村" }, 
    	"邱一村": { position: [121.651077, 29.85511], tit: "邱一村" },
    	"邱二村": { position: [121.651025, 29.848775], tit: "邱二村" }, 
    	"渔金村": { position: [121.629553, 29.845171], tit: "渔金村" }, 
    	"方庄社区": { position: [121.636669, 29.852461], tit: "方庄社区" }, 
    	"张家瀛村": { position: [121.652106, 29.827498], tit: "张家瀛村" }, 
    	"镇南社区": { position: [121.645899, 29.850866], tit: "镇南社区" }, 
    	"镇北社区": { position: [121.641846, 29.857582], tit: "镇北社区" } 
    },
    "塘溪镇": { 
    	"沙村": { position: [121.704012, 29.665626], tit: "沙村" },
    	"童村": { position: [121.678079, 29.655937], tit: "童村" }, 
    	"施村": { position: [121.711149, 29.665748], tit: "施村" }, 
    	//"东山村": { position: [121.672047, 29.683627], tit: "东山村" },
    	//"观山村": { position: [121.747673, 29.691976], tit: "观山村" },
    	"管江村": { position: [121.70333, 29.689441], tit: "管江村" }, 
    	"上城村": { position: [121.694307, 29.69392], tit: "上城村" },
    	"上周村": { position: [121.668731, 29.646216], tit: "上周村" },
    	"塘头村": { position: [121.717194, 29.667031], tit: "塘头村" },
    	"夏家村": { position: [121.665936, 29.648083], tit: "夏家村" },
    	"育碶村": { position: [121.720773, 29.690869], tit: "育碶村" }, 
    	"邹溪村": { position: [121.724989, 29.669771], tit: "邹溪村" },
    	"大碧浦村": { position: [121.758372, 29.682794], tit: "大碧浦村" },
    	"前溪头村": { position: [121.705824, 29.685072], tit: "前溪头村" },
    	//"塘溪镇人民政府": { position: [121.720875, 29.667863], tit: "塘溪镇人民政府" } 
    	},
    "五乡镇": {
    	"汇纤村": { position: [121.688713, 29.85081], tit: "汇纤村" }, 
    	"四安村": { position: [121.683353, 29.849152], tit: "四安村" }, 
    	"永乐村": { position: [121.732494, 29.845731], tit: "永乐村" }, 
    	"项隘村": { position: [121.66611, 29.865773], tit: "项隘村" },
    	//"皎矸何村": { position: [121.694867, 29.849508], tit: "皎矸何村" },
    	"明伦村": { position: [121.735523,29.845078], tit: "明伦村" },
    	//"五乡镇镇政府": { position: [121.701682, 29.85122], tit: "五乡镇镇政府" }
    	}, 
    "云龙镇": { 
    	//"顿岙村": { position: [121.619417, 29.763104], tit: "顿岙村" },
    	"王夹岙": { position: [121.606556, 29.770021], tit: "王夹岙" },
    	"园堍村": { position: [121.643235, 29.797776], tit: "园堍村" },
    	"前徐村": { position: [121.615646, 29.786192], tit: "前徐村" }, 
    	//"任新村": { position: [121.581659, 29.759613], tit: "任新村" }, 
    	"石桥村": { position: [121.598799, 29.758922], tit: "石桥村" },
    	//"徐东埭村": { position: [121.582505, 29.755904], tit: "徐东埭村" },
    	//"姚家浦村": { position: [121.591176, 29.778967], tit: "姚家浦村" }, 
    	"云达社区": { position: [121.608076, 29.781503], tit: "云达社区" }, 
    	"利顺新材料有限公司": { position: [121.610267, 29.777011], tit: "利顺新材料有限公司" } 
    	}, 
    "瞻岐镇": { 
    	"东城村": { position: [121.792847, 29.712804], tit: "东城村" }, 
    	"东一村": { position: [121.83386, 29.741622], tit: "东一村" }, 
    	"东二村": { position: [121.835034, 29.73897], tit: "东二村" }, 
    	//"方桥村": { position: [121.802279, 29.730126], tit: "方桥村" }, 
    	//"卢一村": { position: [121.862925, 29.744786], tit: "卢一村" }, 
    	//"南一村": { position: [121.831508, 29.736818], tit: "南一村" },
    	"岐化村": { position: [121.819704, 29.706447], tit: "岐化村" }, 
    	"岐西村": { position: [121.825701, 29.73353], tit: "岐西村" }, 
    	"嵩一村": { position: [121.783185, 29.713372], tit: "嵩一村" },
    	"唐家村": { position: [121.818496, 29.721426], tit: "唐家村" },
    	"西城村": { position: [121.788532, 29.710817], tit: "西城村" },
    	"姚家村": { position: [121.810884, 29.72134], tit: "姚家村" }, 
    	"周一村": { position: [121.76307, 29.705413], tit: "周一村" }, 
    	//"合一村": { position: [121.855754, 29.740745], tit: "合一村" },
    	"滨海社区": { position: [121.864996, 29.724621], tit: "滨海社区" },
    	"岐下洋村": { position: [121.854684, 29.724313], tit: "岐下洋村" }, 
    	"张东周村": { position: [121.833065, 29.771088], tit: "张东周村" } 
    	},
    "姜山镇": {
    	//"定桥村": { position: [121.5828, 29.780222], tit: "定桥村" },
    	//"东光村": { position: [121.54526, 29.772629], tit: "东光村" },
    		//"顾家村": { position: [121.493807, 29.77462], tit: "顾家村" },
    		"后鄮村": { position: [121.526015, 29.749812], tit: "后鄮村" }, 
    		"上游村": { position: [121.556312, 29.726714], tit: "上游村" }, 
    		"上张村": { position: [121.559473, 29.781629], tit: "上张村" }, 
    		"唐叶村": { position: [121.507376, 29.748005], tit: "唐叶村" }, 
    		"同三村": { position: [121.508503, 29.724193], tit: "同三村" }, 
    		"宏洲村": { position: [121.57831, 29.781636], tit: "宏洲村" },
    		//"花园村": { position: [121.487985, 29.751188], tit: "花园村" },
    		"姜南村": { position: [121.550719, 29.718078], tit: "姜南村" }, 
    		//"井亭村": { position: [121.565179, 29.781111], tit: "井亭村" }, 
    		"联荣村": { position: [121.530474, 29.725559], tit: "联荣村" },
    		"茅东村": { position: [121.508717, 29.740351], tit: "茅东村" },
    		"茅山村": { position: [121.481074, 29.744288], tit: "茅山村" },
    		"南林村": { position: [121.522303, 29.737746], tit: "南林村" }, 
    		"墙弄村": { position: [121.538678, 29.77635], tit: "墙弄村" }, 
    		//"蓉江村": { position: [121.510072, 29.780621], tit: "蓉江村" },
    		"山西村": { position: [121.574038, 29.720233], tit: "山西村" }, 
    		"上何村": { position: [121.52541, 29.776887], tit: "上何村" }, 
    		"新汪村": { position: [121.54518, 29.745069], tit: "新汪村" }, 
    		"甬江村": { position: [121.506278, 29.768259], tit: "甬江村" },
    		//"郁家村": { position: [121.530105, 29.779758], tit: "郁家村" },
    		"周韩村": { position: [121.505462, 29.792778], tit: "周韩村" }, 
    		"翻石渡村": { position: [121.491655, 29.790728], tit: "翻石渡村" },
    		"黎山后村": { position: [121.539576, 29.726276], tit: "黎山后村" }, 
    		"走马塘村": { position: [121.49253, 29.725768], tit: "走马塘村" },
    		"蔡郎桥村": { position: [121.547521, 29.729618], tit: "蔡郎桥村" }, 
    		"陈介桥村": { position: [121.563743, 29.769812], tit: "陈介桥村" }, 
    		"东林寺村": { position: [121.520788, 29.756434], tit: "东林寺村" }, 
    		//"东西郑村": { position: [121.480438, 29.784832], tit: "东西郑村" }, 
    		"董家跳村": { position: [121.518379, 29.717987], tit: "董家跳村" }, 
    		"奉先桥村": { position: [121.492542, 29.788206], tit: "奉先桥村" }, 
    		"虎啸漕村": { position: [121.511776, 29.738932], tit: "虎啸漕村" },
    		"景江岸村": { position: [121.534792, 29.750454], tit: "景江岸村" },
    		//"陆家堰村": { position: [121.58483, 29.765534], tit: "陆家堰村" }, 
    		"沈风水村": { position: [121.493318, 29.720766], tit: "沈风水村" }, 
    		"五龙桥村": { position: [121.557419, 29.714616], tit: "五龙桥村" },
    		//"新张俞村": { position: [121.482065, 29.76607], tit: "新张俞村" },
    		//"阳府兴村": { position: [121.558382, 29.732229], tit: "阳府兴村" }, 
    		"杨家弄村": { position: [121.506023, 29.757957], tit: "杨家弄村" }, 
    		"张村庙村": { position: [121.493582, 29.765294], tit: "张村庙村" }, 
    		"明南小区": { position: [121.541086, 29.770424], tit: "明南小区" },
    		"星城社区": { position: [121.550219, 29.770088], tit: "星城社区" },
    		"张华山村": { position: [121.547633, 29.764433], tit: "张华山村" },
    		"小城春秋社区": { position: [121.537885, 29.760482], tit: "小城春秋社区" }
    		}, 
    "咸祥镇": {
    	//"镇政府": {position: [121.781589, 29.69304], tit: "镇政府" },
    	"球山村": {position: [121.81418,29.693862], tit: "球山村" }
    	},
    "东吴镇": {
		//"东村": { position: [121.73861, 29.812299], tit: "东村" },
    	//"南村": { position: [121.736445, 29.810909], tit: "南村" }, 
    	//"西村": { position: [121.73454, 29.813072], tit: "西村" },
    	//"北村": { position: [121.736517, 29.815892], tit: "北村" },
    	"小白村": { position: [121.756768, 29.810597], tit: "小白村" },
    	//"生姜村": { position: [121.733229, 29.833881], tit: "生姜村" }, 
    	"天童村": { position: [121.784572, 29.793791], tit: "天童村" },
    	"童一村": { position: [121.774429, 29.797308], tit: "童一村" },
    	"勤勇村": { position: [121.81195, 29.77493], tit: "勤勇村" },
    	"画龙村": { position: [121.774047, 29.769166], tit: "画龙村" }, 
    	//"平塘村": { position: [121.718043, 29.820449], tit: "平塘村" }, 
    	"下三塘村": { position: [121.80727, 29.800178], tit: "下三塘村" } 
    	}, 
	"东胜街道": { 
		"泰和社区": { position: [121.580504, 29.877509], tit: "泰和社区" }, 
		"王家社区": { position: [121.57856, 29.882425], tit: "王家社区" },
		"史家社区": { position: [121.574299, 29.880453], tit: "史家社区" },
		"张斌社区": { position: [121.582651, 29.873848], tit: "张斌社区" },
		"曙光社区": { position: [121.576563, 29.882908], tit: "曙光社区" }, 
		"庆安社区": { position: [121.571221, 29.876966], tit: "庆安社区" },
		"戎家社区": { position: [121.582179, 29.88178], tit: "戎家社区" },
		"樱花社区": { position: [121.585531, 29.87353], tit: "樱花社区" }, 
		"大河社区": { position: [121.571834, 29.877787], tit: "大河社区" }
				 }, 
	"明楼街道": { 
			 "朝晖社区": { position: [121.58499, 29.881568], tit: "朝晖社区" },
			 "东海社区": { position: [121.58273, 29.885581], tit: "东海社区" }, 
			 "明北社区": { position: [121.589907, 29.887594], tit: "明北社区" }, 
			 "明东社区": { position: [121.591588, 29.883542], tit: "明东社区" }, 
			 "明南社区": { position: [121.586696, 29.884269], tit: "明南社区" }, 
			 "徐家社区": { position: [121.583497, 29.884325], tit: "徐家社区" }, 
			 "庆丰社区": { position: [121.581019, 29.89249], tit: "庆丰社区" }, 
			 "惊驾社区": { position: [121.57653, 29.887242], tit: "惊驾社区" }, 
			 "常青藤社区": { position: [121.592782, 29.889881], tit: "常青藤社区" }
			 }, 
	"白鹤街道": { 
			"紫鹃社区": { position: [121.578571, 29.861272], tit: "紫鹃社区" }, 
			"丹凤社区": { position: [121.580819, 29.859569], tit: "丹凤社区" },
			 "白鹤社区": { position: [121.574219, 29.860659], tit: "白鹤社区" }, 
			 "黄鹂社区": { position: [121.575874, 29.858292], tit: "黄鹂社区" }, 
			 "孔雀社区": { position: [121.563629, 29.864505], tit: "孔雀社区" }, 
			 "王隘社区": { position: [121.565802, 29.861489], tit: "王隘社区" }, 
			 "周宿渡社区": { position: [121.56065, 29.858808], tit: "周宿渡社区" }
			 }, 
	"东柳街道": { 
			"中兴社区": { position: [121.597625, 29.880249], tit: "中兴社区" }, 
			"月季社区": { position: [121.591333, 29.8581], tit: "月季社区" }, 
			"锦苑社区": { position: [121.594847, 29.879093], tit: "锦苑社区" }, 
			"园丁社区": { position: [121.593837, 29.863087], tit: "园丁社区" }, 
			"幸福苑社区": { position: [121.591718, 29.876989], tit: "幸福苑社区" }, 
			"东柳坊社区": { position: [121.590101, 29.861705], tit: "东柳坊社区" }, 
			"太古城社区": { position: [121.598835, 29.864996], tit: "太古城社区" }, 
			"华侨城社区": { position: [121.588699, 29.867683], tit: "华侨城社区" }, 
			"华光城社区": { position: [121.60141, 29.863914], tit: "华光城社区" }, 
			"东海花园社区": { position: [121.601406, 29.879619], tit: "东海花园社区" }, 
			"安居幸福社区": { position: [121.596972, 29.875264], tit: "安居幸福社区" }
		 }, 
	"百丈街道": { 
			 "华严社区": { position: [121.57383, 29.868634], tit: "华严社区" }, 
			 "划船社区": { position: [121.576371, 29.869117], tit: "划船社区" }, 
			 "宁舟社区": { position: [121.580427, 29.865952], tit: "宁舟社区" }, 
			 "七塔社区": { position: [121.572074, 29.874011], tit: "七塔社区" }, 
			 "潜龙社区": { position: [121.577558, 29.871087], tit: "潜龙社区" }, 
			 "演武社区": { position: [121.569153, 29.869491], tit: "演武社区" }, 
			 "中山社区": { position: [121.584144, 29.86865], tit: "中山社区" }, 
			 "朱雀社区": { position: [121.583691, 29.866318], tit: "朱雀社区" } 
			},
	 "福明街道": { 
			 "陆嘉社区": { position: [121.612691, 29.896835], tit: "陆嘉社区" },
			 "新源社区": { position: [121.611071, 29.876037], tit: "新源社区" }, 
			 "碧城社区": { position: [121.606111, 29.8717], tit: "碧城社区" }, 
			 "新城社区": { position: [121.640791, 29.865634], tit: "新城社区" }, 
			 "东城社区": { position: [121.631073, 29.869467], tit: "东城社区" }, 
			 "福城社区": { position: [121.610105, 29.880177], tit: "福城社区" }, 
			 "宁城社区": { position: [121.612281, 29.88051], tit: "宁城社区" }, 
			 "福明家园社区": { position: [121.607484, 29.880775], tit: "福明家园社区" }, 
			 "宁城星河花园": { position: [121.618483, 29.878458], tit: "宁城星河花园" } 
			}, 
	"东郊街道": { 
			"宁丰社区": { position: [121.556736, 29.855504], tit: "宁丰社区" },
		    "海悦社区": { position: [121.584027, 29.858267], tit: "海悦社区" }
			 },
	"新明街道": { 
			"锦诚花园": { position: [121.621066, 29.900551], tit: "锦诚花园" }, 
			"永久花园": { position: [121.618818, 29.900512], tit: "永久花园" }, 
			"滨江社区": { position: [121.618899, 29.90123], tit: "滨江社区" } },
			
	"中河街道": { 
			"彩虹社区": { position: [121.567103, 29.850061], tit: "彩虹社区" },
			"东裕社区": { position: [121.581687, 29.827379], tit: "东裕社区" }, 
			"春江花城": { position: [121.578713, 29.832542], tit: "春江花城" }, 
			"东湖花园": { position: [121.57685, 29.84053], tit: "东湖花园" }, 
			"凤凰新村": { position: [121.5708, 29.854643], tit: "凤凰新村" }, 
			//"剑桥社区": { position: [121.572846, 29.82917], tit: "剑桥社区" }, 
			"飞虹社区": { position: [121.56613, 29.854426], tit: "飞虹社区" }, 
			"金馨社区": { position: [121.57319, 29.838242], tit: "金馨社区" }, 
			"汪董社区": { position: [121.561389, 29.832929], tit: "汪董社区" }, 
			"桑菊社区": { position: [121.568808, 29.843552], tit: "桑菊社区" }, 
			"兴裕社区": { position: [121.565247, 29.836423], tit: "兴裕社区" }, 
			"城兴社区": { position: [121.565043, 29.840187], tit: "城兴社区" }, 
			"东城社区": { position: [121.583375, 29.842083], tit: "东城社区" }, 
			"天城社区": { position: [121.575979, 29.829331], tit: "天城社区" }, 
			"锦寓社区": { position: [121.562583, 29.836082], tit: "锦寓社区" }, 
			"宋诏桥社区": { position: [121.569995, 29.852327], tit: "宋诏桥社区" }
		 }, 
	"首南街道": { 
			 "桃江村": { position: [121.573399, 29.796999], tit: "桃江村" }, 
			 "前周村": { position: [121.537469, 29.801865], tit: "前周村" }, 
			 //"石家村": { position: [121.547561, 29.78698], tit: "石家村" }, 
			 "三里村": { position: [121.539522, 29.786044], tit: "三里村" }, 
			// "茶亭庵村": { position: [121.528129, 29.798459], tit: "茶亭庵村" }, 
			 //"石路头村": { position: [121.541324, 29.801865], tit: "石路头村" }, 
			// "高塘桥村": { position: [121.527343, 29.79129], tit: "高塘桥村" }, 
			 "南裕社区": { position: [121.560073, 29.810793], tit: "南裕社区" }, 
			 "九曲社区": { position: [121.530564, 29.808151], tit: "九曲社区" }, 
			 "学府社区": { position: [121.566423, 29.814826], tit: "学府社区" }, 
			 "日丽社区": { position: [121.573719, 29.815453], tit: "日丽社区" }, 
			 "城南社区": { position: [121.43425, 29.292684], tit: "城南社区" },
			 "和众社区": { position: [121.43325, 29.292454], tit: "和众社区" },
			// "文化社区": { position: [121.53608, 29.884071], tit: "文化社区" }, 
			 "和众社区": { position: [121.546063, 29.800926], tit: "和众社区" }, 
			 //"陈婆渡社区": { position: [121.553719, 29.799233], tit: "陈婆渡社区" }, 
			 "格兰春天小区": { position: [121.551616, 29.801078], tit: "格兰春天小区" }, 
			 //"金色水岸社区": { position: [121.535814, 29.824127], tit: "金色水岸社区" }
			 },
   "下应街道": { 
		   "姜村": { position: [121.586805, 29.800873], tit: "姜村" }, 
		   "曹隘村": { position: [121.613725, 29.847514], tit: "曹隘村" },
		   "东升村": { position: [121.592325, 29.796527], tit: "东升村" }, 
		   "河东村": { position: [121.60205, 29.809429], tit: "河东村" }, 
		   "河西村": { position: [121.599819, 29.810323], tit: "河西村" }, 
		   "江六村": { position: [121.612579, 29.812489], tit: "江六村" }, 
		   "黎明村": { position: [121.614547, 29.801637], tit: "黎明村" }, 
		   "妙胜村": { position: [121.612871, 29.843516], tit: "妙胜村" }, 
		   "胜利村": { position: [121.599169, 29.807279], tit: "胜利村" }, 
		   "童王村": { position: [121.595189, 29.846306], tit: "童王村" }, 
		   "土桥村": { position: [121.596876, 29.825889], tit: "土桥村" }, 
		   "成人学校": { position: [121.596856, 29.825823], tit: "成人学校" }, 
		   "湾底村": { position: [121.58926, 29.81211], tit: "湾底村" }, 
		   "德培小学": { position: [121.597059, 29.84197], tit: "德培小学" }, 
		   "东升社区": { position: [121.593845, 29.801347], tit: "东升社区" }, 
		   "史家码村": { position: [121.608206, 29.803709], tit: "史家码村" }, 
		   "王家弄村": { position: [121.605529, 29.85483], tit: "王家弄村" }, 
		   "小花园村": { position: [121.599757, 29.84162], tit: "小花园村" }, 
		   "李关弟中学": { position: [121.604306, 29.811973], tit: "李关弟中学" }, 
		   "下应中心小学": { position: [121.599294, 29.80892], tit: "下应中心小学" }, 
		   "下应街道敬老院": { position: [121.598224, 29.807691], tit: "下应街道敬老院" }, 
		   
		   "海创社区": { position: [121.580862,29.796279], tit: "海创社区" }
		 }, 
    "潘火街道": { 
			 "东南社区": { position: [121.609483, 29.837505], tit: "东南社区" }, 
			 "东莺社区": { position: [121.59398, 29.849588], tit: "东莺社区" }, 
			 "世纪社区": { position: [121.601665, 29.850398], tit: "世纪社区" }, 
			 "雅苑社区": { position: [121.607703, 29.864005], tit: "雅苑社区" }, 
			 "紫郡社区": { position: [121.598421, 29.829176], tit: "紫郡社区" }, 
			 "殷家社区": { position: [121.604247, 29.850061], tit: "殷家社区" }, 
			 "星苑社区": { position: [121.601753, 29.853992], tit: "星苑社区" }, 
			 "尚诚社区": { position: [121.55162, 29.835972], tit: "尚诚社区" }, 
			 "同欣社区": { position: [121.593816, 29.846189], tit: "同欣社区" }, 
			 "盛世东方": { position: [121.608505, 29.865131], tit: "盛世东方" }, 
			 "中山华底": { position: [121.6034505, 29.865134], tit: "中山华底" }, 
			 "百丈花苑": { position: [121.592203, 29.865415], tit: "百丈花苑" }, 
			 "中山华庭": { position: [121.545398, 29.822943], tit: "中山华庭" }, 
			 "潘火桥社区": { position: [121.595191, 29.841572], tit: "潘火桥社区" }, 
			 "潘火街道办": { position: [121.589142, 29.830552], tit: "潘火街道办" }
			 }, 
	"钟公庙街道": { 
			"长丰社区": { position: [121.548785, 29.845415], tit: "长丰社区" }, 
			"都市森林": { position: [121.554315, 29.83631], tit: "都市森林" }, 
			"繁裕社区": { position: [121.539442, 29.828555], tit: "繁裕社区" }, 
			"后庙社区": { position: [121.556414, 29.837267], tit: "后庙社区" }, 
			//"凌江社区": { position: [121.535602, 29.828392], tit: "凌江社区" }, 
			"钟裕社区": { position: [121.547608, 29.836543], tit: "钟裕社区" }, 
			"金宁社区": { position: [121.55327, 29.848486], tit: "金宁社区" }, 
			"惠风社区": { position: [121.545398, 29.822943], tit: "惠风社区" }, 
			"泰安社区": { position: [121.544538, 29.809574], tit: "泰安社区" }, 
			"钟公庙社区": { position: [121.549153, 29.828308], tit: "钟公庙社区" }, 
			"金色水岸": { position: [121.534093,29.823994], tit: "金色水岸" }
			//"金家漕社区": { position: [121.554742, 29.842772], tit: "金家漕社区" } 
		}, 
	"澥浦镇": {
		"沿山村": { position: [121.599672, 30.033683], tit: "沿山村" }, 
		"觉渡村": { position: [121.600591, 30.027764], tit: "觉渡村" }, 
		"庙戴村": { position: [121.605573, 30.018657], tit: "庙戴村" }, 
		"岚山村": { position: [121.626018, 30.028936], tit: "岚山村" }, 
		"澥浦村": { position: [121.615775, 30.039817], tit: "澥浦村" }, 
		"十七房村": { position: [121.609073, 30.030328], tit: "十七房村" }
	 }, 
 "蛟川街道": {
	 "中一村": { position: [121.685231, 29.95528], tit: "中一村" }, 
	 "俞范村": { position: [121.683954, 29.966568], tit: "俞范村" }, 
	 "沿江村": { position: [121.688037, 29.939524], tit: "沿江村" }, 
	 "临江社区": { position: [121.682428, 29.940564], tit: "临江社区" }, 
	 "渡驾桥村": { position: [121.681539, 29.941159], tit: "渡驾桥村" }, 
	 "俞范社区": { position: [121.658093, 29.977956], tit: "俞范社区" }, 
	 "东信路社区": { position: [121.681156, 29.946972], tit: "东信路社区" }, 
	 "汉博贵金属": { position: [121.672738, 29.9288], tit: "汉博贵金属" }, 
	 "启盛生物食品": { position: [121.665136, 29.948013], tit: "启盛生物食品" } 
	}, 
"骆驼街道": { 
		"东邑村": { position: [121.610563, 29.985668], tit: "东邑村" }, 
		"团桥村": { position: [121.598936, 29.964175], tit: "团桥村" }, 
		"余三村": { position: [121.582937, 29.989703], tit: "余三村" }, 
		"清水湖村": { position: [121.593148, 30.01001], tit: "清水湖村" }, 
		"南一社区": { position: [121.597147, 29.985089], tit: "南一社区" }, 
		"董家畈村": { position: [121.602996, 29.990931], tit: "董家畈村" }, 
		"中街社区": { position: [121.594791, 29.985871], tit: "中街社区" }, 
		"静远社区": { position: [121.591448, 29.981718], tit: "静远社区" }, 
		"绅乐电子": { position: [121.585172, 29.977307], tit: "绅乐电子" } 
	}, 
	"庄市街道": { 
		"庄一社区": { position: [121.631611, 29.941355], tit: "庄一社区" }, 
		"高教社区": { position: [121.639616, 29.924591], tit: "高教社区" }, 
		"兴庄路社区": { position: [121.622193, 29.927231], tit: "兴庄路社区" }, 
		"陈倪路社区": { position: [121.616692, 29.942473], tit: "陈倪路社区" }, 
		"万市徐村村委": { position: [121.654967, 29.954451], tit: "万市徐村村委" }, 
		"庄市社区服务中心": { position: [121.627029, 29.935537], tit: "庄市社区服务中心" }
	 },
	
	 
			 
			 
			 
	 
//	 余姚
	  
	 
	 
	 
	 
	 
	 "九龙湖镇": { 
		 "长宏村": { position: [121.55615, 29.99269], tit: "长宏村" }, 
		 "长石村": { position: [121.551412, 29.98993], tit: "长石村" }, 
		 "中心村": { position: [121.520678, 30.007461], tit: "中心村" }, 
		 "西河村": { position: [121.545555, 30.012723], tit: "西河村" }, 
		 "坟溪村": { position: [121.515622, 30.007414], tit: "坟溪村" }, 
		 "西径堂村": { position: [121.563809, 30.015428], tit: "西径堂村" }, 
		 "田杨陈村": { position: [121.569387, 30.024481], tit: "田杨陈村" }, 
		 "九龙湖村": { position: [121.549025, 30.038512], tit: "九龙湖村" } 
		}, 
	"招宝山街道": { 
		"海港社区": { position: [121.725041, 29.964034], tit: "海港社区" }, 
		"城东社区": { position: [121.727777, 29.959927], tit: "城东社区" }, 
		"西门社区": { position: [121.711643, 29.962993], tit: "西门社区" }, 
		"顺隆社区": { position: [121.71489, 29.959588], tit: "顺隆社区" }, 
		"白龙社区": { position: [121.702858, 29.960459], tit: "白龙社区" }, 
		"总浦桥社区": { position: [121.72237, 29.958064], tit: "总浦桥社区" }, 
		"胜利路社区": { position: [121.721904, 29.960365], tit: "胜利路社区" },
	    "车站路社区": { position: [121.709637, 29.958269], tit: "车站路社区" }, 
		"张监矸社区": { position: [121.705518, 29.957974], tit: "张监矸社区" } 
	}, 
	"白峰镇": { 
		"白峰村": { position: [122.004146, 29.884988], tit: "白峰村" }, 
		"路亭村": { position: [122.048313, 29.859695], tit: "路亭村" }, 
		"神马村": { position: [122.002062, 29.897479], tit: "神马村" }, 
		"下阳村": { position: [121.984107, 29.82395], tit: "下阳村" }, 
		"新峰村": { position: [121.99668, 29.883977], tit: "新峰村" }, 
		"阳东村": { position: [122.001895, 29.835081], tit: "阳东村" }, 
		"小门村": { position: [121.97896, 29.874085], tit: "小门村" }, 
		"峰城社区": { position: [121.997978, 29.885172], tit: "峰城社区" }, 
		"怡峰社区": { position: [122.005515, 29.889151], tit: "怡峰社区" }, 
		"大岭下村": { position: [122.01899, 29.86028], tit: "大岭下村" } },
  "春晓镇": { 
	  "咸昶村": { position: [121.892539, 29.778889], tit: "咸昶村" }, 
	  "干岙村": { position: [121.950213, 29.793417], tit: "干岙村" }, 
	  "民丰村": { position: [121.841951, 29.784253], tit: "民丰村" }, 
	  "昆亭社区": { position: [121.931028, 29.805525], tit: "昆亭社区" } 
	}, 
	
	
	
	
 "梅山镇": { 
	 "梅中村": { position: [122.001844, 29.800621], tit: "梅中村" }
	 },
	 
"霞浦街道": { 
	 "陈华村": { position: [121.871444,29.891852], tit: "陈华村" },
	 "河东村": { position: [121.887781,29.894636], tit: "河东村" },
	 "书院村": { position: [121.869841,29.891908], tit: "书院村" },
	 "凤凰社区": { position: [121.855792,29.892488], tit: "凤凰社区" },
	 "陈华浦社区": { position: [121.871067,29.887392], tit: "陈华浦社区" },
	 "黄鹂社区": { position: [121.847237,29.889862], tit: "黄鹂社区" }
	 }, 
	 
	 
 "柴桥街道": { 
	 "沃家村": { position: [121.926088, 29.880883], tit: "沃家村" }, 
	 "四合村": { position: [121.911208, 29.846855], tit: "四合村" }, 
	"芦南社区": { position: [121.924159, 29.8718], tit: "芦南社区" }, 
	"瑞岩社区": { position: [121.901046, 29.838698], tit: "瑞岩社区" } 
	}, 
"小港街道": { 
	"方前村": { position: [121.754404, 29.928054], tit: "方前村" }, 
	"红联村": { position: [121.729249, 29.947395], tit: "红联村" }, 
	"孔墅村": { position: [121.755878, 29.940956], tit: "孔墅村" }, 
	"山下村": { position: [121.711531, 29.927484], tit: "山下村" }, 
	"新模村": { position: [121.670982, 29.910978], tit: "新模村" }, 
	"新棉村": { position: [121.674746, 29.914854], tit: "新棉村" }, 
	"新政村": { position: [121.677147, 29.899916], tit: "新政村" }, 
	"衙前村": { position: [121.708349, 29.940552], tit: "衙前村" }, 
	"朱田村": { position: [121.698601, 29.928828], tit: "朱田村" }, 
	"姚墅村": { position: [121.715418, 29.889006], tit: "姚墅村" }, 
	"陈山社区": { position: [121.733275, 29.927992], tit: "陈山社区" }, 
	"竺山社区": { position: [121.737689, 29.935084], tit: "竺山社区" }, 
	"红联社区": { position: [121.726566, 29.94744], tit: "红联社区" }, 
	"顾家桥村": { position: [121.719337, 29.914945], tit: "顾家桥村" }, 
	"鲍家洋村": { position: [121.712002, 29.90279], tit: "鲍家洋村" }, 
	"丁家山村": { position: [121.703698, 29.872917], tit: "丁家山村" }, 
	"东升社区": { position: [121.754174, 29.955098], tit: "东升社区" }, 
	"枫林社区": { position: [121.722291, 29.915571], tit: "枫林社区" }, 
	"下邵社区": { position: [121.714128, 29.885846], tit: "下邵社区" }, 
	"北仑老人福利院": { position: [121.85525, 29.929097], tit: "北仑老人福利院" }, 
	"宁波联合实验小学": { position: [121.759592, 29.951766], tit: "宁波联合实验小学" } 
}, 
"大碶街道": { 
	"城东村": { position: [121.841809, 29.867685], tit: "城东村" }, 
	"牌门村": { position: [121.825867, 29.881704], tit: "牌门村" }, 
	"城联村": { position: [121.844364, 29.861011], tit: "城联村" }, 
	"邬隘村": { position: [121.784233, 29.888361], tit: "邬隘村" }, 
	"璎珞村": { position: [121.758468, 29.857781], tit: "璎珞村" }, 
	"坝头社区": { position: [121.806862, 29.901194], tit: "坝头社区" }, 
	"灵岩社区": { position: [121.77838, 29.882652], tit: "灵岩社区" }, 
	"学苑社区": { position: [121.826229, 29.892776], tit: "学苑社区" }, 
	"太白社区": { position: [121.814334, 29.892564], tit: "太白社区" }, 
	"横杨社区": { position: [121.792309, 29.905917], tit: "横杨社区" }, 
	"金泉社区": { position: [121.803245, 29.898316], tit: "金泉社区" }, 
	"高田王社区": { position: [121.799991, 29.892748], tit: "高田王社区" },
	"方夏梅花鹿场": { position: [121.792391, 29.834548], tit: "方夏梅花鹿场" }
 }, 
 "新碶街道": { 
	 "永久村": { position: [121.78595,29.939575], tit: "永久村" }, 
	 "贝碶村": { position: [121.836727,29.912192], tit: "贝碶村" }, 
	 "镇安村": { position: [121.845231,29.930054], tit: "镇安村" }, 
	 "紫荆社区": { position: [121.845898,29.923214], tit: "紫荆社区" }, 
	 "杜鹃社区": { position: [121.855712,29.914013], tit: "杜鹃社区" }, 
	 "银杏社区": { position: [121.820957,29.935684], tit: "银杏社区" } ,
	 "红梅社区": { position: [121.848829,29.914628], tit: "红梅社区" } ,
	 "迎春社区": { position: [121.848899,29.914833], tit: "迎春社区" } ,
	 "玉兰社区": { position: [121.832878,29.905134], tit: "玉兰社区" } ,
	 "海棠社区": { position: [121.846161,29.913275], tit: "海棠社区" } ,
	 "芙蓉社区": { position: [121.866925,29.913643], tit: "芙蓉社区" } ,
	 "米兰社区": { position: [121.833844,29.893201], tit: "米兰社区" } ,
	 "高塘社区": { position: [121.797604,29.926265], tit: "高塘社区" } ,
	 "大港社区": { position: [121.849798,29.917276], tit: "大港社区" } ,
	 "凌霄社区": { position: [121.845837,29.900702], tit: "凌霄社区" } 
	}, 
"戚家山街道": { 
	"蔚斗社区": { position: [121.750786, 29.95741], tit: "蔚斗社区" } 
}, 
"梅墟街道": { 
	"聚贤社区": { position: [121.643164, 29.890625], tit: "聚贤社区" }, 
	"梅苑社区": { position: [121.6686, 29.900031], tit: "梅苑社区" }, 
	"梅福社区": { position: [121.6669, 29.893342], tit: "梅福社区" }, 
	"菁华社区": { position: [121.648922, 29.882648], tit: "菁华社区" }, 
	"凌云产业园": { position: [121.660003, 29.889314], tit: "凌云产业园" }
 }, 
 "贵驷街道": { 
	 "民联村": { position: [121.615934, 29.991787], tit: "民联村" }, 
	 "贵驷村": { position: [121.624391, 29.981562], tit: "贵驷村" }, 
	 "东钱村": { position: [121.620241, 29.960532], tit: "东钱村" }, 
	 "妙胜村": { position: [121.634534, 29.969071], tit: "妙胜村" }, 
	 "里洞桥村": { position: [121.629301, 29.983475], tit: "里洞桥村" }
	 }, 
//修改重名被覆盖	 
//"浒山街道": {
//	 "浒西社区": { position: [121.230295, 30.170759], tit: "浒西社区" } 
//}, 
"杭州湾新区": { 
	"三洋村": { position: [121.293423, 30.297543], tit: "三洋村" }, 
	"珠江村": { position: [121.169382, 30.279091], tit: "珠江村" }, 
	"振东村": { position: [121.233091, 30.267459], tit: "振东村" }, 
	"兴陆村": { position: [121.248318, 30.298963], tit: "兴陆村" }, 
	"白鹭园": { position: [121.229751, 30.331399], tit: "白鹭园" }, 
	"竹溪园": { position: [121.228618, 30.331056], tit: "竹溪园" },
	"丁香苑": { position: [121.618563, 29.897686], tit: "丁香苑" }, 
	"桥南村": { position: [121.17915, 30.294906], tit: "桥南村" }, 
	"新东村": { position: [121.470119, 30.093415], tit: "新东村" }, 
	"虹桥村": { position: [121.18742, 30.276663], tit: "虹桥村" }, 
	"新建村": { position: [121.195307, 30.238953], tit: "新建村" }, 
	"宏兴村": { position: [121.226371, 30.27869], tit: "宏兴村" }, 
	"华兴村": { position: [121.198236, 30.291001], tit: "华兴村" }, 
	"新舟村": { position: [121.269363, 30.301262], tit: "新舟村" }, 
	"马潭路村": { position: [121.365078, 30.280017], tit: "马潭路村" }, 
	"下一灶村": { position: [121.345753, 30.284224], tit: "下一灶村" }, 
	"杭州湾新区": { position: [121.329137, 30.299062], tit: "杭州湾新区" }
 }, 
 
 "马渚镇": { 
	 "斗门村": { position: [121.086068, 30.058401], tit: "斗门村" }, 
	 "庙前村": { position: [121.059314, 30.057513], tit: "庙前村" }, 
	 "四联村": { position: [121.054994, 30.026208], tit: "四联村" }, 
	 "沿山村": { position: [121.039653, 30.118176], tit: "沿山村" }, 
	 "姚家村": { position: [121.136936, 29.936728], tit: "姚家村" }, 
	 "渚北村": { position: [121.051439, 30.089805], tit: "渚北村" }, 
	 "长泠江村": { position: [121.070457, 30.097087], tit: "长泠江村" }, 
	 "大将桥村": { position: [121.071866, 30.126096], tit: "大将桥村" }, 
	 "菁江渡村": { position: [121.100378, 30.054123], tit: "菁江渡村" }, 
	 "乐安湖村": { position: [121.058985, 30.054003], tit: "乐安湖村" }, 
	 "马漕头村": { position: [121.098691, 30.073744], tit: "马漕头村" }, 
	 "全佳桥村": { position: [121.04209, 30.132099], tit: "全佳桥村" }, 
	 "下叶社区": { position: [121.056598, 30.077521], tit: "下叶社区" }, 
	 "瑶街弄村": { position: [121.07631, 30.060002], tit: "瑶街弄村" }, 
	 "下沙畈村": { position: [121.057818, 30.113116], tit: "下沙畈村" }, 
	 "云雾塑业": { position: [121.052232, 30.088425], tit: "云雾塑业" } 
	}, 
	"牟山镇": { 
		"牟山镇": { position: [121.007007, 30.080132], tit: "牟山镇" }, 
		"牟山村": { position: [121.004046, 30.079626], tit: "牟山村" }, 
		"青港村": { position: [121.031351, 30.09319], tit: "青港村" }, 
		"狮山村": { position: [121.035661, 30.084742], tit: "狮山村" }, 
		"魏家村": { position: [121.001617, 30.080201], tit: "魏家村" },
		"湖心村": { position: [121.001645, 30.080301], tit: "湖心村" },
		"牟山湖村": { position: [121.025013, 30.071418], tit: "牟山湖村" }, 
		"新东吴村": { position: [120.987974, 30.079328], tit: "新东吴村" }, 
		"牟山镇政府": { position: [121.007294, 30.079846], tit: "牟山镇政府" }
	 }, 
	 "丈亭镇": { 
		  
		 "半岙村": { position: [121.302484, 30.063317], tit: "半岙村" }, 
		 "凤东村": { position: [121.318903, 30.031798], tit: "凤东村" }, 
		 "胡界村": { position: [121.302868, 30.018553], tit: "胡界村" }, 
		 "汇龙村": { position: [121.27754, 30.033353], tit: "汇龙村" }, 
		 "龙丰村": { position: [121.255322, 30.046623], tit: "龙丰村" }, 
		 "梅溪村": { position: [121.22969, 30.04873], tit: "梅溪村" }, 
		 "丈亭村": { position: [121.287125, 30.020541], tit: "丈亭村" }, 
		 "渔溪村": { position: [121.293239, 30.037286], tit: "渔溪村" }, 
		 "寺前王村": { position: [121.29019, 30.049772], tit: "寺前王村" }, 
		 "丈亭镇政府": { position: [121.288348, 30.035513], tit: "丈亭镇政府" } 
		}, 
	"泗门镇": { 
		
		"泗北村": { position: [121.037622, 30.172635], tit: "泗北村" }, 
		"东浦村": { position: [121.051826, 30.14108], tit: "东浦村" }, 
		"夹塘村": { position: [121.024994, 30.194518], tit: "夹塘村" }, 
		"万圣村": { position: [121.0447, 30.217186], tit: "万圣村" }, 
		"镇北村": { position: [121.052568, 30.184994], tit: "镇北村" }, 
		"镇南村": { position: [121.072042, 30.152781], tit: "镇南村" }, 
		"湖北村": { position: [121.008516, 30.191606], tit: "湖北村" }, 
		"镇政府": { position: [121.048395, 30.165413], tit: "镇政府" }, 
		"大庙周村": { position: [121.07574, 30.17006], tit: "大庙周村" }, 
		"上新屋村": { position: [121.08848, 30.180154], tit: "上新屋村" }, 
		"水阁周村": { position: [121.07025, 30.171009], tit: "水阁周村" }, 
		"楝树下村": { position: [121.008479, 30.201637], tit: "楝树下村" },
		"小路下村": { position: [121.008459, 30.201537], tit: "小路下村" }
	}, 
	"临山镇": { 
		"临山镇": { position: [120.995497, 30.159905], tit: "临山镇" }, 
		"湖堤村": { position: [121.020836, 30.160734], tit: "湖堤村" }, 
		"兰海村": { position: [120.972473, 30.167278], tit: "兰海村" }, 
		"汝东村": { position: [121.035066, 30.15172], tit: "汝东村" }, 
		"临南村": { position: [121.008705, 30.151624], tit: "临南村" }, 
		"临山村": { position: [121.005718, 30.158713], tit: "临山村" }, 
		"临城村": { position: [121.001453, 30.157868], tit: "临城村" }, 
		"临海村": { position: [120.988348, 30.177745], tit: "临海村" }, 
		"临浦村": { position: [120.991069, 30.181433], tit: "临浦村" }, 
		"梅园村": { position: [120.968522, 30.177691], tit: "梅园村" }, 
		"味香园": { position: [120.982883, 30.173327], tit: "味香园" }, 
		"邵家丘村": { position: [120.968894, 30.158761], tit: "邵家丘村" }, 
		"临山镇政府": { position: [120.995304, 30.159821], tit: "临山镇政府" } 
}, 
	"陆埠镇": { 
		
		"郭姆村": { position: [121.261859, 30.011173], tit: "郭姆村" }, 
		"江南村": { position: [121.24495, 30.005735], tit: "江南村" }, 
		"干溪村": { position: [121.237859, 29.969075], tit: "干溪村" }, 
		"兰山村": { position: [121.211445, 29.934503], tit: "兰山村" }, 
		"石门村": { position: [121.197739, 29.955007], tit: "石门村" }, 
		"南雷村": { position: [121.225657, 29.996686], tit: "南雷村" }, 
		"裘岙村": { position: [121.229011, 29.898644], tit: "裘岙村" }, 
		"翁岙村": { position: [121.223944, 29.91169], tit: "翁岙村" }, 
		"沿江村": { position: [121.288042, 30.005133], tit: "沿江村" }, 
		"袁马村": { position: [121.236333, 29.940833], tit: "袁马村" }, 
		"蒋岙村": { position: [121.272594, 29.906443], tit: "蒋岙村" }, 
		"石笋村": { position: [121.234525, 29.905252], tit: "石笋村" }, 
		"洪山村": { position: [121.235443, 29.934575], tit: "洪山村" }, 
		"五马村": { position: [121.257806, 30.001324], tit: "五马村" }, 
		"杜徐岙村": { position: [121.20844, 29.922619], tit: "杜徐岙村" }, 
		"余鲍陈村": { position: [121.280913, 29.91372], tit: "余鲍陈村" }, 
		"新民乐园": { position: [121.24597, 30.008716], tit: "新民乐园" } 
	}, 
	"大隐镇": { 
		
		"大隐村": { position: [121.385282, 29.941966], tit: "大隐村" }, 
		"云旱村": { position: [121.372358, 29.934199], tit: "云旱村" }, 
		"章山村": { position: [121.344447, 29.93093], tit: "章山村" }, 
		"芝林村": { position: [121.312073, 29.933295], tit: "芝林村" }, 
		"学士桥村": { position: [121.372736, 29.940489], tit: "学士桥村" }, 
		"大隐镇政府": { position: [121.381312, 29.946948], tit: "大隐镇政府" } 
	}, 
	"梁弄镇": { 
		
		"东山村": { position: [121.096776, 29.893602], tit: "东山村" }, 
		"甘宣村": { position: [121.085999, 29.902102], tit: "甘宣村" }, 
		"高南村": { position: [121.117699, 29.943976], tit: "高南村" }, 
		"贺溪村": { position: [121.049169, 29.904479], tit: "贺溪村" }, 
		"横路村": { position: [121.05408, 29.923702], tit: "横路村" }, 
		"后陈村": { position: [121.073239, 29.92317], tit: "后陈村" }, 
		"湖东村": { position: [121.100567, 29.940323], tit: "湖东村" }, 
		"梁冯村": { position: [121.0866, 29.912294], tit: "梁冯村" }, 
		"岭头村": { position: [121.070946, 29.870157], tit: "岭头村" }, 
		"汪巷村": { position: [121.074961, 29.901522], tit: "汪巷村" }, 
		"雅贤村": { position: [121.086507, 29.961843], tit: "雅贤村" }, 
		"五桂村": { position: [121.085432, 29.922305], tit: "五桂村" }, 
		"明湖村": { position: [121.059834, 29.961647], tit: "明湖村" }, 
		"白水冲村": { position: [121.093978, 29.888975], tit: "白水冲村" }, 
		"梁弄百果园": { position: [121.074029, 29.905838], tit: "梁弄百果园" }, 
		"梁弄镇镇政府": { position: [121.08498, 29.915751], tit: "梁弄镇镇政府" } 
	}, 
	"大岚镇": { 
		
		"大岚村": { position: [121.115042, 29.842867], tit: "大岚村" }, 
		"大俞村": { position: [121.15233, 29.770316], tit: "大俞村" }, 
		"戴糜村": { position: [121.113109, 29.818617], tit: "戴糜村" }, 
		"柿林村": { position: [121.16458, 29.800438], tit: "柿林村" }, 
		"上马村": { position: [121.164653, 29.840467], tit: "上马村" }, 
		"新岚村": { position: [121.183617, 29.823271], tit: "新岚村" }, 
		"雅庄村": { position: [121.152902, 29.832244], tit: "雅庄村" }, 
		"南岚村": { position: [121.137991, 29.810661], tit: "南岚村" }, 
		"后朱村": { position: [121.144948, 29.847932], tit: "后朱村" }, 
		"大路下村": { position: [121.15939, 29.823381], tit: "大路下村" }, 
		"阴地龙潭": { position: [121.106071, 29.792632], tit: "阴地龙潭" }, 
		"丁家畈村": { position: [121.134123, 29.826933], tit: "丁家畈村" }, 
		"黄家庄村": { position: [121.124287, 29.799029], tit: "黄家庄村" } 
	}, 
	"鹿亭乡": { 
 
		"高山村": { position: [121.17754, 29.896368], tit: "高山村" }, 
		"高岩村": { position: [121.181133, 29.897133], tit: "高岩村" }, 
		"龙溪村": { position: [121.153145, 29.87317], tit: "龙溪村" }, 
		"上庄村": { position: [121.209338, 29.882616], tit: "上庄村" }, 
		"晓云村": { position: [121.164536, 29.885962], tit: "晓云村" }, 
		"中村村": { position: [121.229599, 29.867898], tit: "中村村" }, 
		"中姚村": { position: [121.147904, 29.8939], tit: "中姚村" }, 
		"石潭村": { position: [121.191302, 29.863781], tit: "石潭村" }, 
		"白鹿村": { position: [121.176139, 29.844955], tit: "白鹿村" }, 
		"李家塔村": { position: [121.212463, 29.86788], tit: "李家塔村" }, 
		"沿夹岙村": { position: [121.218624, 29.896002], tit: "沿夹岙村" }, 
		"鹿亭乡政府": { position: [121.211278, 29.883153], tit: "鹿亭乡政府" }
	 }, 
	 "凤山街道": { 
 
		 "永丰村": { position: [121.171207, 30.092886], tit: "永丰村" }, 
		 "五星村": { position: [121.182677, 30.109948], tit: "五星村" }, 
		 "胜一村": { position: [121.171159, 30.072021], tit: "胜一村" }, 
		 "蜀山村": { position: [121.233877, 30.032821], tit: "蜀山村" }, 
		 "凤山社区": { position: [121.176419, 30.054225], tit: "凤山社区" }, 
		 "凤山街道": { position: [121.186419, 30.074225], tit: "凤山街道" },
		 "子陵社区": { position: [121.166893, 30.067866], tit: "子陵社区" }, 
		 "九垒山村": { position: [121.197882, 30.051308], tit: "九垒山村" }, 
		 "东江社区": { position: [121.182445, 30.068562], tit: "东江社区" }, 
		 "鑫高医疗": { position: [121.224671, 30.049536], tit: "鑫高医疗" }, 
		 "酱园街社区": { position: [121.171065, 30.052937], tit: "酱园街社区" }, 
		 "季卫桥社区": { position: [121.167089, 30.062822], tit: "季卫桥社区" }, 
		 "浙江嘉贝斯": { position: [121.16523, 30.05521], tit: "浙江嘉贝斯" } 
		}, 
	"阳明街道": { 

		"北郊村": { position: [121.160519, 30.092564], tit: "北郊村" }, 
		"方桥村": { position: [121.093794, 30.108535], tit: "方桥村" }, 
		"丰乐村": { position: [121.100983, 30.090194], tit: "丰乐村" }, 
		"丰南村": { position: [121.122567, 30.053165], tit: "丰南村" }, 
		"群立村": { position: [121.120325, 30.060393], tit: "群立村" }, 
		"潘巷村": { position: [121.119976, 30.087535], tit: "潘巷村" }, 
		"芝山村": { position: [121.106549, 30.10206], tit: "芝山村" }, 
		"梁堰村": { position: [121.125769, 30.120232], tit: "梁堰村" }, 
		"康山村": { position: [121.142579, 30.073797], tit: "康山村" }, 
		"西街村": { position: [121.092312, 30.108313], tit: "西街村" }, 
		"庙弄村": { position: [121.092302, 30.108213], tit: "庙弄村" }, 
		"长安社区": { position: [121.142784, 30.048146], tit: "长安社区" }, 
		"富巷社区": { position: [121.150322, 30.056933], tit: "富巷社区" }, 
		"锦江社区": { position: [121.13365, 30.052146], tit: "锦江社区" }, 
		"舜水社区": { position: [121.151314, 30.051523], tit: "舜水社区" }, 
		"龙泉社区": { position: [121.155001, 30.053718], tit: "龙泉社区" }, 
		"胜山社区": { position: [121.157383, 30.062857], tit: "胜山社区" }, 
		"阳明社区": { position: [121.157813, 30.057118], tit: "阳明社区" }, 
		"丰山前村": { position: [121.146718, 30.063758], tit: "丰山前村" }, 
		"姚驾桥村": { position: [121.112293, 30.121037], tit: "姚驾桥村" }, 
		"新城市社区": { position: [121.14278, 30.053592], tit: "新城市社区" } 
	},
 "梨洲街道": { 
 
		 "明伟村": { position: [121.195658, 30.025746], tit: "明伟村" }, 
		 "长田村": { position: [121.14157, 29.920476], tit: "长田村" }, 
		 "陈洪村": { position: [121.20148, 29.978656], tit: "陈洪村" }, 
		 "金冠村": { position: [121.149071, 29.952698], tit: "金冠村" }, 
		 "姜家渡": { position: [121.215126, 30.026942], tit: "姜家渡" }, 
		 "茭湖村": { position: [121.165806, 29.91662], tit: "茭湖村" }, 
		 "三溪村": { position: [121.141964, 30.008158], tit: "三溪村" }, 
		 "南庙村": { position: [121.169883, 30.003764], tit: "南庙村" }, 
		 "双桥村": { position: [121.165516, 30.016414], tit: "双桥村" }, 
		 "新墅村": { position: [121.192052, 30.012294], tit: "新墅村" }, 
		 "最良村": { position: [121.165298, 30.040298], tit: "最良村" }, 
		 "雁湖村": { position: [121.150978, 29.957738], tit: "雁湖村" }, 
		 "燕窝村": { position: [121.184789, 29.96703], tit: "燕窝村" }, 
		 "竹山村": { position: [121.192183, 30.037779], tit: "竹山村" }, 
		 "学弄社区": { position: [121.166895, 30.048672], tit: "学弄社区" }, 
		 "花园社区": { position: [121.167158, 30.044784], tit: "花园社区" }, 
		 "阳光社区": { position: [121.194481, 30.025619], tit: "阳光社区" }, 
		 "白云社区": { position: [121.170861, 30.039062], tit: "白云社区" }, 
		 "古路头村": { position: [121.178831, 30.02586], tit: "古路头村" }, 
		 "上王岗村": { position: [121.165431, 29.916552], tit: "上王岗村" }, 
		 "苏家园村": { position: [121.16325, 30.00325], tit: "苏家园村" }, 
		 "章雅山村": { position: [121.132172, 29.921107], tit: "章雅山村" }, 
		 "江翠社区": { position: [121.174702, 30.005658], tit: "江翠社区" }, 
		 "三江口社区": { position: [121.176, 30.045026], tit: "三江口社区" }, 
		 "东朝街社区": { position: [121.170932, 30.048814], tit: "东朝街社区" }, 
		 "南雷里社区": { position: [121.165599, 30.042831], tit: "南雷里社区" }, 
		 "梨洲街道办事处": { position: [121.180031, 30.022899], tit: "梨洲街道办事处" } 
		}, 
	"兰江街道": { 
 
		"冯村": { position: [121.10775, 29.986079], tit: "冯村" }, 
		"凤亭村": { position: [121.109342, 30.017809], tit: "凤亭村" }, 
		"筀竹村": { position: [121.089112, 30.017293], tit: "筀竹村" }, 
		"沈湾村": { position: [121.06175, 30.022458], tit: "沈湾村" }, 
		"西郊村": { position: [121.153331, 30.048499], tit: "西郊村" }, 
		"夏巷村": { position: [121.072451, 30.038684], tit: "夏巷村" }, 
		"下菱社区": { position: [121.151464, 30.044265], tit: "下菱社区" }, 
		"舜南社区": { position: [121.160467, 30.047509], tit: "舜南社区" },
		"四明社区": { position: [121.14919, 30.035599], tit: "四明社区" }, 
		"丰杨河村": { position: [121.111822, 30.041832], tit: "丰杨河村" }, 
		"郭相桥村": { position: [121.096882, 30.039498], tit: "郭相桥村" }, 
		"兰墅桥村": { position: [121.137371, 30.040564], tit: "兰墅桥村" }, 
		"磨刀桥村": { position: [121.1609, 30.02976], tit: "磨刀桥村" }, 
		"三凤桥村": { position: [121.139181, 30.021031], tit: "三凤桥村" }, 
		"石婆桥村": { position: [121.125184, 30.021263], tit: "石婆桥村" },
		"慧兰社区": { position: [121.125284, 30.022263], tit: "慧兰社区" }, 
		"大叶园林": { position: [121.19121, 30.052328], tit: "大叶园林" }, 
		"江南新城社区": { position: [121.161611, 30.037198], tit: "江南新城社区" } 
	},
	"低塘街道": {
	   
		"黄湖村": { position: [121.207056, 30.156492], tit: "黄湖村" }, 
		"芦城村": { position: [121.171924, 30.173761], tit: "芦城村" }, 
		"姆湖村": { position: [121.176641, 30.156576], tit: "姆湖村" }, 
		"洋山村": { position: [121.215643, 30.177011], tit: "洋山村" }, 
		"郑巷村": { position: [121.170413, 30.124752], tit: "郑巷村" }, 
		"低塘村": { position: [121.155384, 30.167243], tit: "低塘村" }, 
		"低塘街道": { position: [121.165384, 30.177243], tit: "低塘街道" }, 
		"汤家闸村": { position: [121.158627, 30.147762], tit: "汤家闸村" }, 
		"镆剑山村": { position: [121.162575, 30.131488], tit: "镆剑山村" }, 
		"西郑巷村": { position: [121.161305, 30.121521], tit: "西郑巷村" }
	 }, 
	 "朗霞街道": { 
		 "邵巷村": { position: [121.088516, 30.174006], tit: "邵巷村" } ,
		 "天中村": { position: [121.089142,30.149625], tit: "天中村" } ,
		 "新新村": { position: [121.11369,30.166942], tit: "新新村" } ,
		 "赵家村": { position: [121.129585,30.15669], tit: "赵家村" } ,
		 "杨家村": { position: [121.069866,30.150458], tit: "杨家村" } ,
		 "熊家村": { position: [121.104798,30.145267], tit: "熊家村" } ,
		 "新南王村": { position: [121.11909,30.135071], tit: "新南王村" },
		 "干家路村": { position: [121.097589,30.173381], tit: "干家路村" },
		 "龙王堂村": { position: [121.153387,30.123654], tit: "龙王堂村" }
	
		}, 
	"三七市镇": { 
	
		"胜利村": { position: [121.36257, 30.031649], tit: "胜利村" }, 
		"幸福村": { position: [121.350657, 30.025907], tit: "幸福村" }, 
		"相岙村": { position: [121.409949, 30.042607], tit: "相岙村" }, 
		"云山村": { position: [121.395441, 30.007432], tit: "云山村" }, 
		"石步村": { position: [121.356152, 30.056219], tit: "石步村" }, 
		"大霖山村": { position: [121.351424, 30.038346], tit: "大霖山村" },
		"二六市村": { position: [121.386694, 30.019615], tit: "二六市村" }, 
		"唐李张村": { position: [121.39968, 30.054451], tit: "唐李张村" }, 
		"魏家桥村": { position: [121.384325, 30.00525], tit: "魏家桥村" }, 
		"祝家渡村": { position: [121.331518, 30.009165], tit: "祝家渡村" }, 
		"三七市村": { position: [121.349558, 30.035586], tit: "三七市村" }, 
		"三七市镇政府": { position: [121.349659, 30.031146], tit: "三七市镇政府" }
	 }, 
	"河姆渡镇": { 
	
		"翁方村": { position: [121.297279, 30.011764], tit: "翁方村" }, 
		"江中村": { position: [121.323435, 29.98908], tit: "江中村" }, 
		"罗江村": { position: [121.372665, 29.991933], tit: "罗江村" }, 
		"车厩村": { position: [121.317699, 29.982145], tit: "车厩村" }, 
		"五联村": { position: [121.310861, 29.964881], tit: "五联村" }, 
		"东澄村": { position: [121.337017, 29.976112], tit: "东澄村" }, 
		"河姆渡村": { position: [121.357543, 29.95982], tit: "河姆渡村" }, 
		"芦山寺村": { position: [121.375852, 29.970453], tit: "芦山寺村" }, 
		"河姆渡镇政府": { position: [121.321733, 29.995281], tit: "河姆渡镇政府" } 
	}, 
	"小曹娥镇": { 
 
		"曹娥村": { position: [121.096279, 30.220392], tit: "曹娥村" }, 
		"曹一村": { position: [121.097582, 30.208021], tit: "曹一村" }, 
		"滨海村": { position: [121.071571, 30.23551], tit: "滨海村" }, 
		"朗海村": { position: [121.082803, 30.226007], tit: "朗海村" }, 
		"建民村": { position: [121.09042, 30.242359], tit: "建民村" }, 
		"人和村": { position: [121.063024, 30.221125], tit: "人和村" }, 
		"镇海村": { position: [121.065591, 30.217092], tit: "镇海村" }, 
		"南新庵村": { position: [121.064267, 30.208814], tit: "南新庵村" }, 
		"小曹娥镇政府": { position: [121.08051, 30.223546], tit: "小曹娥镇政府" }
	 }, 
	 "黄家埠镇": { 
 
		 "杏山村": { position: [120.995473, 30.106072], tit: "杏山村" }, 
		 "高桥村": { position: [120.97628, 30.130547], tit: "高桥村" }, 
		 "横塘村": { position: [120.951042, 30.159641], tit: "横塘村" }, 
		 "华家村": { position: [120.974918, 30.103251], tit: "华家村" }, 
		 "韩夏村": { position: [120.948614, 30.136874], tit: "韩夏村" }, 
		 "上塘村": { position: [120.96152, 30.125092], tit: "上塘村" }, 
		 "黄家埠村": { position: [120.96525, 30.144987], tit: "黄家埠村" }, 
		 "十六户村": { position: [120.943501, 30.15464], tit: "十六户村" }, 
		 "五车堰村": { position: [120.9562, 30.100329], tit: "五车堰村" }, 
		 "黄家埠镇政府": { position: [120.971829, 30.132726], tit: "黄家埠镇政府" }
		 }, 
	"四明山镇": { 
 
		"梨洲村": { position: [121.125872, 29.741958], tit: "梨洲村" }, 
		"北溪村": { position: [121.144021, 29.743928], tit: "北溪村" }, 
		"茶培村": { position: [121.15591, 29.728883], tit: "茶培村" }, 
		"唐田村": { position: [121.13065, 29.704292], tit: "唐田村" }, 
		"大山村": { position: [121.056703, 29.764842], tit: "大山村" }, 
		"悬岩村": { position: [121.0438, 29.76297], tit: "悬岩村" }, 
		"溪山村": { position: [121.052054, 29.744791], tit: "溪山村" }, 
		"平莲村": { position: [121.098881, 29.715013], tit: "平莲村" }, 
		"杨湖村": { position: [121.044003, 29.709596], tit: "杨湖村" }, 
		"芦田村": { position: [121.035169, 29.738175], tit: "芦田村" }, 
		"棠溪村": { position: [121.059988, 29.728098], tit: "棠溪村" }, 
		"宓家村": { position: [121.41445, 30.126441], tit: "宓家村" }
	 },
	 "经济开发区": { 
		
		"穴湖村": { position: [121.20295, 30.06487], tit: "穴湖村" } 
	}, 
	 "余姚市科协": {
		"市科协科普长廊": { position: [121.141146, 30.036596], tit: "市科协科普长廊" } 
			},
			// 奉化空的 
	// "溪口镇": { 
	// 	"溪口镇": { position: [121.288508, 29.694481], tit: "溪口镇" } 
	// 		}, 
	// "尚田镇": { 
	// 	"尚田镇": { position: [121.415329, 29.628016], tit: "尚田镇" }
	//  }, 
	// "莼湖镇": {
	// 	"莼湖镇": { position: [121.523201, 29.57972], tit: "莼湖镇" }
	//  }, 
	// "裘村镇": { 
	// 	"裘村镇": { position: [121.629692, 29.60953], tit: "裘村镇" } 
	// }, 
	// "大堰镇": { 
	// 	"大堰镇": { position: [121.310843, 29.509988], tit: "大堰镇" } 
	// }, 
	// "松岙镇": {
	// 	"松岙镇": { position: [121.69192, 29.607259], tit: "松岙镇" } 
	// }, 
	// "锦屏街道": { 
	// 	"锦屏街道": { position: [121.416777, 29.681676], tit: "锦屏街道" } 
	// }, 
	// "岳林街道": {
	// 	"岳林街道": { position: [121.446587, 29.666678], tit: "岳林街道" } 
	// }, 
	// "江口街道": { 
	// 	"江口街道": { position: [121.412958, 29.730545], tit: "江口街道" } 
	// }, 
	// "西坞街道": { 
	// 	"西坞街道": { position: [121.499693, 29.685171], tit: "西坞街道" } 
	// }, 
	// "萧王庙街道": { 
	// 	"萧王庙街道": { position: [121.364404, 29.708239], tit: "萧王庙街道" } 
	// }, 
	// 宁海空的
//	 "长街镇": { 
//	 	"长街镇": { position: [121.71965, 29.253484], tit: "长街镇" } 
//	 }, 
//	 
//	 "力洋镇": { 
//	 	"力洋镇": { position: [121.625271, 29.306536], tit: "力洋镇" } 
//	 }, 
//	 "一市镇": { 
//	 	"一市镇": { position: [121.48604, 29.206363], tit: "一市镇" } 
//	 }, 
//	 "岔路镇": { 
//	 	"岔路镇": { position: [121.321331, 29.208305], tit: "岔路镇" } 
//	 },
//	  "前童镇": { 
//	 	 "前童镇": { position: [121.354864, 29.234539], tit: "前童镇" } 
//	 	}, 
//	 "桑洲镇": { 
//	 	"桑洲镇": { position: [121.324307, 29.160376], tit: "桑洲镇" } 
//	 }, 
//	 "黄坛镇": { 
//	 	"黄坛镇": { position: [121.36886, 29.300804], tit: "黄坛镇" } 
//	 }, 
//	 "强蛟镇": { 
//	 	"强蛟镇": { position: [121.537438, 29.463833], tit: "强蛟镇" } 
//	 }, 
//	 "西店镇": { 
//	 	"西店镇": { position: [121.447155, 29.490239], tit: "西店镇" } 
//	 }, 
//	 "深圳镇": { 
//	 	"深圳镇": { position: [121.355087, 29.42138], tit: "深圳镇" } 
//	 }, 
//	 "胡陈乡": { 
//	 	"胡陈乡": { position: [121.683749, 29.331784], tit: "胡陈乡" } }, 
//	 "茶院乡": { 
//	 	"茶院乡": { position: [121.579185, 29.321058], tit: "茶院乡" } 
//	 }, 
//	 "越溪乡": { 
//	 	"越溪乡": { position: [121.528166, 29.270395], tit: "越溪乡" } 
//	 }, 
//	 "跃龙街道": { 
//	 	"跃龙街道": { position: [121.440158, 29.301269], tit: "跃龙街道" } 
//	 }, 
//	 "桃源街道": { 
//	 	"桃源街道": { position: [121.462436, 29.342082], tit: "桃源街道" }
//	  }, 
//	  "梅林街道": { 
//	 	 "梅林街道": { position: [121.449328, 29.383534], tit: "梅林街道" } 
//	 	}, 
//	 "大佳何镇": { 
//	 	"大佳何镇": { position: [121.561765, 29.431585], tit: "大佳何镇" }
//	  }, 
//	  "桥头胡街道": { 
//	 	 "桥头胡街道": { position: [121.49373, 29.388576], tit: "桥头胡街道" } 
//	 	}, 
		// 象山
	"西周镇": { 
 
		"官山村": { position: [121.658856, 29.462514], tit: "官山村" }, 
		"夏叶村": { position: [121.702211, 29.468139], tit: "夏叶村" }, 
		"航头村": { position: [121.645435, 29.477385], tit: "航头村" }, 
		"东瀛村": { position: [121.681208, 29.483778], tit: "东瀛村" }, 
		"弘瀛村": { position: [121.682388, 29.483523], tit: "弘瀛村" }, 
		"杨岙村": { position: [121.739729, 29.510515], tit: "杨岙村" } 
	}, 
	"贤庠镇": { 

		"东风村": { position: [121.860084, 29.574639], tit: "东风村" }, 
		"木瓜村": { position: [121.885743, 29.611146], tit: "木瓜村" }, 
		"西山下村": { position: [121.84179, 29.589345], tit: "西山下村" }, 
		"沈家洋村": { position: [121.87383, 29.569481], tit: "沈家洋村" },
		"溪天陈村": { position: [121.87283, 29.569381], tit: "溪天陈村" }, 
		"官司塘村": { position: [121.867194, 29.600846], tit: "官司塘村" } 
	}, 
	"大徐镇": { 

		"大徐村": { position: [121.895906, 29.536915], tit: "大徐村" }, 
		"下院村": { position: [121.90483, 29.556887], tit: "下院村" }, 
		"下岙村": { position: [121.870372, 29.514465], tit: "下岙村" }, 
		"雅林溪村": { position: [121.879797, 29.517436], tit: "雅林溪村" }, 
		"章家弄村": { position: [121.887317, 29.516062], tit: "章家弄村" }, 
		"三角地村": { position: [121.866654, 29.551731], tit: "三角地村" }, 
		"汤家店村": { position: [121.890052, 29.527774], tit: "汤家店村" }, 
		"新罗岙村": { position: [121.872291, 29.501304], tit: "新罗岙村" } 
	}, 
	"涂茨镇": { 
 
		"涂茨村": { position: [121.942042, 29.563751], tit: "涂茨村" }, 
		"珠山村": { position: [121.916244, 29.565527], tit: "珠山村" }, 
		"黄沙村": { position: [121.953572, 29.617715], tit: "黄沙村" }, 
		"长沙村": { position: [121.997996, 29.593277], tit: "长沙村" }, 
		"下盆岙村": { position: [121.925584, 29.555366], tit: "下盆岙村" }, 
		"前山姚村": { position: [121.966408, 29.583543], tit: "前山姚村" }, 
		"旭拱岙村": { position: [121.956256, 29.560318], tit: "旭拱岙村" } 
	}, 
	"晓塘乡": { 

		"黄埠村": { position: [121.893035, 29.221814], tit: "黄埠村" }, 
		"鹤洋村": { position: [121.872832, 29.20865], tit: "鹤洋村" }, 
		"晓塘村": { position: [121.845499, 29.212739], tit: "晓塘村" }, 
		"月楼村": { position: [121.863069, 29.202066], tit: "月楼村" }, 
		"胡家峙村": { position: [121.820243, 29.207677], tit: "胡家峙村" }, 
		"双连峙村": { position: [121.823998, 29.189998], tit: "双连峙村" }, 
		"青山头村": { position: [121.828482, 29.197125], tit: "青山头村" }, 
		"西边塘村": { position: [121.8053, 29.187486], tit: "西边塘村" }
	 }, 
	 "茅洋乡": { 
 
		 "兴坑村": { position: [121.8117, 29.389767], tit: "兴坑村" }, 
		 "李家弄村": { position: [121.837153, 29.388397], tit: "李家弄村" },
		 "乌石峤村": { position: [121.837253, 29.388297], tit: "乌石峤村" }, 
		 "小白岩村": { position: [121.838512, 29.414721], tit: "小白岩村" } 
		}, 
	"石浦镇": { 
 
		"南向村": { position: [121.859573, 29.186971], tit: "南向村" }, 
		"五新村": { position: [121.95065, 29.23659], tit: "五新村" }, 
		"平阳厂村": { position: [121.857143, 29.172964], tit: "平阳厂村" }, 
		"海宁社区": { position: [121.937966, 29.203035], tit: "海宁社区" }, 
		"荔港社区": { position: [121.951994, 29.207134], tit: "荔港社区" }, 
		"延昌社区": { position: [121.956977, 29.230398], tit: "延昌社区" } 
	}, 
	"墙头镇": { 

		"墙头村": { position: [121.791067, 29.469604], tit: "墙头村" }, 
		"黄溪村": { position: [121.829254, 29.484656], tit: "黄溪村" }, 
		"舫前村": { position: [121.770868, 29.482937], tit: "舫前村" }, 
		"岭下村": { position: [121.769382, 29.474712], tit: "岭下村" }, 
		"西泸村": { position: [121.777082, 29.526133], tit: "西泸村" }, 
		"雷港村": { position: [121.814853, 29.477075], tit: "雷港村" }, 
		"洋北村": { position: [121.830015, 29.504901], tit: "洋北村" }, 
		"下沙村": { position: [121.772697, 29.51594], tit: "下沙村" }, 
		"白墩村": { position: [121.841161, 29.529553], tit: "白墩村" }, 
		"周家路村": { position: [121.835023, 29.51429], tit: "周家路村" }, 
		"孙家村": { position: [121.768862, 29.505642], tit: "孙家村" }, 
		"塔岭村": { position: [121.822688, 29.482181], tit: "塔岭村" }, 
		"亭岙村": { position: [121.85057, 29.487323], tit: "亭岙村" }, 
		"毛洋岭": { position: [121.851012, 29.45666], tit: "毛洋岭" }, 
		"桃湾村": { position: [121.854012, 29.46666], tit: "桃湾村" }, 
		"合心村": { position: [121.509274, 29.902733], tit: "合心村" }, 
		"方家岙村": { position: [121.792344, 29.456856], tit: "方家岙村" }, 
		"溪里方村": { position: [121.78819, 29.461041], tit: "溪里方村" }, 
		"盛旺张村": { position: [121.745784, 29.448208], tit: "盛旺张村" }, 
		"欢乐农庄": { position: [121.791112, 29.469587], tit: "欢乐农庄" }, 
		"七里亭村": { position: [121.791345, 29.469457], tit: "七里亭村" }, 
		"蔡家岙村B": { position: [121.823352, 29.467876], tit: "蔡家岙村B" }, 
		"七里亭村B": { position: [121.839223, 29.482448], tit: "七里亭村B" },
		"七里亭村A": { position: [121.739223, 29.485448], tit: "七里亭村A" }
	}, 
	"新桥镇": { 

		"石昌": { position: [121.195307, 30.238953], tit: "石昌" }, 
		"高塘村": { position: [121.883986, 29.307754], tit: "高塘村" }, 
		"上盘村": { position: [121.86394, 29.295793], tit: "上盘村" }, 
		"韩升村": { position: [121.812557, 29.364326], tit: "韩升村" }, 
		"洋坑村": { position: [121.876564, 29.359932], tit: "洋坑村" }, 
		"海台村": { position: [121.820923, 29.36481], tit: "海台村" }, 
		"板岭村": { position: [121.847347, 29.353441], tit: "板岭村" }, 
		"灵岙村": { position: [121.841357, 29.285889], tit: "灵岙村" }, 
		"镇政府": { position: [121.874618, 29.319834], tit: "镇政府" }, 
		"庙前村": { position: [121.868734, 29.351727], tit: "庙前村" }, 
		"井头村": { position: [121.839528, 29.363651], tit: "井头村" }, 
		"上七里": { position: [121.859072, 29.311556], tit: "上七里" }, 
		"五兴村": { position: [121.379104, 29.303206], tit: "五兴村" }, 
		"黄公岙村": { position: [121.868493, 29.299186], tit: "黄公岙村" }, 
		"下七里村": { position: [121.850763, 29.310925], tit: "下七里村" }, 
		"黄吉岙村": { position: [121.840438, 29.316427], tit: "黄吉岙村" }, 
		"七林湾村": { position: [121.918448, 29.292888], tit: "七林湾村" }, 
		"山头王村": { position: [121.872579, 29.360881], tit: "山头王村" }, 
		"石柱里村": { position: [121.891471, 29.324383], tit: "石柱里村" }, 
		"石柱外村": { position: [121.881271, 29.323057], tit: "石柱外村" } 
	},
	 "定塘镇": { 

		 "花港村": { position: [121.815604, 29.236814], tit: "花港村" },
		 "洋岙村": { position: [121.87389, 29.252353], tit: "洋岙村" }, 
		 "下营村": { position: [121.884343, 29.240155], tit: "下营村" }, 
		 "葫芦门村": { position: [121.861068, 29.22528], tit: "葫芦门村" }, 
		 "宁波站村": { position: [121.81123, 29.226793], tit: "宁波站村" }, 
		 "蒲白墩村": { position: [121.819288, 29.251195], tit: "蒲白墩村" }, 
		 "小太平村": { position: [121.870278, 29.262177], tit: "小太平村" } 
		}, 
	"丹东街道": { 

		"梅溪村": { position: [121.903614, 29.492568], tit: "梅溪村" }, 
		"东环村": { position: [121.917294, 29.464922], tit: "东环村" }, 
		"下余村": { position: [121.934863, 29.441922], tit: "下余村" }, 
		"陆家村": { position: [121.90812, 29.463989], tit: "陆家村" }, 
		"河东村": { position: [121.920593, 29.463863], tit: "河东村" }, 
		"高俞村": { position: [121.905425, 29.461829], tit: "高俞村" }, 
		"蒋家村": { position: [121.912404, 29.451793], tit: "蒋家村" }, 
		"河西村": { position: [121.918396, 29.460203], tit: "河西村" }, 
		"西林村": { position: [121.908002, 29.452805], tit: "西林村" }, 
		"南门村": { position: [121.884292, 29.476374], tit: "南门村" }, 
		"东塘村": { position: [121.930199, 29.44137], tit: "东塘村" }, 
		"文峰社区": { position: [121.887117, 29.481247], tit: "文峰社区" }, 
		"塔山社区": { position: [121.899712, 29.480973], tit: "塔山社区" }, 
		"丹峰社区": { position: [121.892488, 29.477162], tit: "丹峰社区" }, 
		"新华社区": { position: [121.887649, 29.479342], tit: "新华社区" }, 
		"梅园社区": { position: [121.897015, 29.492359], tit: "梅园社区" }, 
		"金秋社区": { position: [121.885992, 29.476908], tit: "金秋社区" }, 
		"东街社区": { position: [121.883842, 29.48359], tit: "东街社区" }, 
		"丹河社区": { position: [121.902412, 29.469846], tit: "丹河社区" }, 
		"桥头林村": { position: [121.919005, 29.457176], tit: "桥头林村" }, 
		"田洋里村": { position: [121.916268, 29.477024], tit: "田洋里村" }, 
		"百合公寓": { position: [121.907435, 29.484808], tit: "百合公寓" }, 
		"门前涂村": { position: [121.899391, 29.460317], tit: "门前涂村" } 
	},
	"丹西街道": { 

		"北门村": { position: [121.8716, 29.482919], tit: "北门村" }, 
		"白石村": { position: [121.874146, 29.450053], tit: "白石村" }, 
		"瑶琳社区": { position: [121.888431, 29.467965], tit: "瑶琳社区" }, 
		"新建社区": { position: [121.87769, 29.47736], tit: "新建社区" }, 
		"蓬莱社区": { position: [121.879213, 29.472596], tit: "蓬莱社区" }, 
		"菱河头村": { position: [121.896802, 29.454575], tit: "菱河头村" }, 
		"文昌社区": { position: [121.877985, 29.474408], tit: "文昌社区" }, 
		"山头董村": { position: [121.894024, 29.441025], tit: "山头董村" }, 
		"丹桂花园": { position: [121.890295, 29.461945], tit: "丹桂花园" }
	 }, 
	 "爵溪街道": { 

		 "公屿村": { position: [121.942351, 29.514015], tit: "公屿村" }, 
		 "前岙村": { position: [121.94274, 29.456007], tit: "前岙村" }, 
		 "瀛海社区": { position: [121.959922, 29.48005], tit: "瀛海社区" },
		 "外来人中心": { position: [121.958922, 29.48105], tit: "外来人中心" } 
		}, 
	"黄避岙乡": { 
 
		"大林村": { position: [121.84951, 29.567353], tit: "大林村" }, 
		"鸭屿村": { position: [121.840117, 29.553822], tit: "鸭屿村" }, 
		"横里村": { position: [121.789918, 29.584633], tit: "横里村" }, 
		"白屿村": { position: [121.814003, 29.558469], tit: "白屿村" }, 
		"横塘村": { position: [121.807715, 29.583748], tit: "横塘村" }, 
		"鲁家岙村": { position: [121.779291, 29.563192], tit: "鲁家岙村" }, 
		"塔头旺村": { position: [121.825818, 29.5524], tit: "塔头旺村" }, 
		"里高泥村": { position: [121.776364, 29.555532], tit: "里高泥村" }, 
		"黄避岙村": { position: [121.825717, 29.583443], tit: "黄避岙村" }
	 }, 
	 "泗洲头镇": { 

		 "墩岙村": { position: [121.764877, 29.311407], tit: "墩岙村" }, 
		 "后王村": { position: [121.762641, 29.392646], tit: "后王村" }, 
	 	"张岙村": { position: [121.75723, 29.405012], tit: "张岙村" }, 
		 "塘岸村": { position: [121.760535, 29.383656], tit: "塘岸村" }, 
		 "下马岙村": { position: [121.775036, 29.325209], tit: "下马岙村" }, 
		 "金家岙村": { position: [121.753859, 29.414126], tit: "金家岙村" }, 
		 "何婆岭村": { position: [121.746854, 29.425004], tit: "何婆岭村" }, 
		 "上马岙村": { position: [121.765822, 29.325156], tit: "上马岙村" }
		 }
}
