var theCity = {
    "绍兴": {
        "越城区": {
            "title": "越城区", "position": [120.592851, 30.005738]
        },
        "柯桥区": {
            "title": "柯桥区", "position": [120.501178, 30.088145]
        },
        "上虞区": {
            "title": "上虞区", "position": [120.866787, 30.040527]
        },
        "新昌县": {
            "title": "新昌县", "position": [120.867486, 29.518743]
        },
        "诸暨市": {
            "title": "诸暨市", "position": [120.269583, 29.717678]
        },
        "嵊州市": {
            "title": "嵊州市", "position": [120.837309, 29.583663]
        },

    }
};
var jb = {
    "越城区": {
        "塔山街道": {position: [120.595545, 29.99497], tit: "塔山街道"},
        "府山街道": {position: [120.580777, 30.002593], tit: "府山街道"},
        "城南街道": {position: [120.586477, 29.981018], tit: "城南街道"},
        "北海街道": {position: [120.579262, 30.012316], tit: "北海街道"},
        "迪荡街道": {position: [120.621517, 30.009423], tit: "迪荡街道"},
        "稽山街道": {position: [120.624913, 29.987309], tit: "稽山街道"},
        "蕺山街道": {position: [120.590803, 30.015397], tit: "蕺山街道"},
    }
};
var allJiedao = {
    //越城区
    "塔山街道": {
        "罗门社区": {position: [120.600356, 29.99061], tit: "罗门社区"},
        "鲁迅故里社区": {position: [120.593345, 29.998085], tit: "鲁迅故里社区"},
        "塔山社区": {position: [120.587892, 29.994626], tit: "塔山社区"},
        "塔山村": {position: [120.601169, 29.990385], tit: "塔山村"},
        "燕甸园社区": {position: [120.594229, 29.999291], tit: "燕甸园社区"},
        "望花社区": {position: [120.592574, 29.991501], tit: "望花社区"},
        "花园社区": {position: [120.601597, 29.999576], tit: "花园社区"},
        "青藤社区": {position: [120.585861, 30.000724], tit: "青藤社区"},
        "滨河社区1": {position: [120.576424, 30.000128], tit: "滨河社区1"},
        "水沟营社区": {position: [120.584302, 29.99786], tit: "水沟营社区"},
    },

    "府山街道": {
        "东双桥社区1": {position: [120.596708, 30.003674], tit: "东双桥社区1"},
        "东双桥社区2": {position: [120.599195, 30.00413], tit: "东双桥社区2"},
        "铁甲营社区": {position: [120.581118, 30.012984], tit: "铁甲营社区"},
        "西小路社区": {position: [120.579934, 30.01409], tit: "西小路社区"},
        "北海社区": {position: [120.574963, 30.011602], tit: "北海社区"},
        "八字桥社区": {position: [120.596228, 30.006225], tit: "八字桥社区"},
        "广宁桥社区": {position: [120.597637, 30.007848], tit: "广宁桥社区"},
        "团结社区": {position: [120.592802, 30.006594], tit: "团结社区"},
        "书圣社区1": {position: [120.590023, 30.013583], tit: "书圣社区1"},
        "书圣社区2": {position: [120.592042, 30.01299], tit: "书圣社区2"},
        "越都社区": {position: [120.584694, 30.004257], tit: "越都社区"},
        "府山社区": {position: [120.583504, 30.003021], tit: "府山社区"},
        "西园社区": {position: [120.576362, 30.007158], tit: "西园社区"},
        "快阁苑社区": {position: [120.563519, 30.006254], tit: "快阁苑社区"},
    },

    "城南街道": {
        "南门社区": {position: [120.584946, 29.984794], tit: "南门社区"},
        "城南社区": {position: [120.588359, 29.983937], tit: "城南社区"},
        "长城社区": {position: [120.581983, 29.986465], tit: "长城社区"},
        "秦望社区": {position: [120.587857, 29.976226], tit: "秦望社区"},
        "南苑社区": {position: [120.589382, 29.966745], tit: "南苑社区"},
        "阳明社区": {position: [120.598969, 29.975609], tit: "阳明社区"},
        "高立社区": {position: [120.583281, 29.977717], tit: "高立社区"},
        "温馨社区": {position: [120.594034, 29.986422], tit: "温馨社区"},
        "华侨社区": {position: [120.581118, 29.981421], tit: "华侨社区"},
        "翠苑社区": {position: [120.587309, 29.979158], tit: "翠苑社区"},
    },
    "北海街道": {
        "下大路社区": {position: [121.187317, 30.253158], tit: "下大路社区"},
        "辕门社区": {position: [121.207227, 30.268588], tit: "辕门社区"},
        "胜利社区": {position: [121.189098, 30.261848], tit: "胜利社区"},
        "火车站社区": {position: [121.180666, 30.263593], tit: "火车站社区"},
        "迎恩门社区": {position: [121.166357, 30.220601], tit: "迎恩门社区"},

    },
    "迪荡街道": {
        "嶯山社区": {position: [120.602844, 30.017417], tit: "嶯山社区"},
        "昌安社区1": {position: [120.601946, 30.021803], tit: "昌安社区1"},
        "昌安社区2": {position: [120.598211, 30.018744], tit: "昌安社区2"},
        "洞桥社区": {position: [120.599922, 30.025669], tit: "洞桥社区"},
        "乐苑社区": {position: [120.603868, 30.024407], tit: "乐苑社区"},
        "龙洲社区1": {position: [120.609199, 30.023744], tit: "龙洲社区1"},
        "都泗社区": {position: [120.608244, 30.007701], tit: "都泗社区"},

    },
    "稽山街道": {
        "鹤池社区": {position: [120.608753, 29.998427], tit: "鹤池社区"},
        "鹤东社区": {position: [120.612659, 29.998741], tit: "鹤东社区"},
        "渡东社区": {position: [120.60424, 29.996624], tit: "渡东社区"},
        "美东社区": {position: [120.617728, 29.996634], tit: "美东社区"},
        "秀水社区": {position: [120.617413, 29.990648], tit: "秀水社区"},
        "大众社区": {position: [120.620726, 29.998253], tit: "大众社区"},
        "森海社区": {position: [120.632499, 29.969503], tit: "森海社区"},
        "涂山社区": {position: [120.61276, 29.98319], tit: "涂山社区"},
        "敦煌社区": {position: [120.626927, 29.986619], tit: "敦煌社区"},
        "城东开发区": {position: [120.611512, 29.991596], tit: "城东开发区"},
    },
    "蕺山街道": {
        "日晖桥社区": {position: [120.590813, 30.010914], tit: "日晖桥社区"},
        "老越城区区府": {position: [120.588782, 29.995308], tit: "老越城区区府"},
    },

}


	