var theCity = {
    "杭州":{
        "杭州上城区":{
            "title":"杭州上城区","position":[120.175901,30.248034]
        },
        "杭州江干区":{
            "title":"杭州江干区","position":[120.209815,30.265057]
		},
		"杭州拱墅区":{
            "title":"杭州拱墅区","position":[120.148299,30.325926]
        }/*,
        "杭州西湖区":{
            "title":"杭州拱墅区","position":[120.136894,30.265595]
        }*/
    }
}
//不动

//
var jb = {

    "杭州上城区":{
        "湖滨":{position:[120.172963,30.258332],tit:"湖滨"},
        "小营":{position:[120.183243,30.245295],tit:"小营"},
        "望江":{position:[120.191167,30.237708],tit:"望江"},
        "南星":{position:[120.178841,30.220677],tit:"南星"},
        "紫阳":{position:[120.176833,30.237785],tit:"紫阳"},
        "清波":{position:[120.167417,30.244115],tit:"清波"},
    },
    "杭州江干区":{
        "采荷街道":{position:[120.204946,30.261477],tit:"采荷街道"},
        "笕桥街道":{position:[120.224697,30.322051],tit:"笕桥街道"},
        "九堡街道":{position:[120.278929,30.317182],tit:"九堡街道"},
        "凯旋街道":{position:[120.210618,30.273424],tit:"凯旋街道"},
        "闸弄口街道":{position:[120.197607,30.29476],tit:"闸弄口街道"},
		"丁兰街道":{position:[120.229413,30.356124],tit:"丁兰街道"},
		"四季青街道":{position:[120.209504,30.258142],tit:"四季青街道"},
		"彭埠街道":{position:[120.235295,30.294919],tit:"彭埠街道"}
	},
	"杭州拱墅区":{
        "湖墅街道":{position:[120.151683,30.299591],tit:"湖墅街道"},
        "和睦街道":{position:[120.130919,30.314186],tit:"和睦街道"},
        "半山街道":{position:[120.18745,30.355144],tit:"半山街道"},
        "大关街道":{position:[120.178841,30.220677],tit:"大关街道"},
        "米市巷街道":{position:[120.156835,30.29247],tit:"米市巷街道"},
		"上塘街道":{position:[120.162737,30.318873],tit:"上塘街道"},
		"小河街道":{position:[120.138601,30.312037 ],tit:"小河街道"},
		"拱宸桥街道":{position:[120.151188,30.327454],tit:"拱宸桥街道"}
		
    },
    "杭州西湖区":{
        "北山街道":{position:[120.156037,30.275095],tit:"北山街道"},
        "蒋村街道":{position:[120.071345,30.286275],tit:"蒋村街道"},
        "留下街道":{position:[120.059497,30.248275],tit:"留下街道"},
        "三墩镇":{position:[120.091725,30.327266],tit:"三墩镇"},
        "文新街道":{position:[120.109967,30.282502],tit:"文新街道"},
		"古荡街道 ":{position:[120.124163,30.278822],tit:"古荡街道 "},
        "翠苑街道":{position:[120.139287,30.280993],tit:"翠苑街道"},
        "双浦镇":{position:[120.128632,30.118838],tit:"双浦镇"},
        "灵隐街道":{position:[120.132991,30.265212],tit:"灵隐街道"},
        "西溪街道":{position:[120.155886,30.281157],tit:"西溪街道"},
		"转塘街道":{position:[120.08629,30.164881],tit:"转塘街道"}
    }
}

var allJiedao = {
// 西湖区
"北山街道": {
    //"沿山河社区":{position:[120.151782,30.276391],tit:"沿山河社区"},			
    "松木场社区":{position:[120.154564,30.274107],tit:"松木场社区"},
    "宝石社区":{position:[120.153063,30.27045],tit:"宝石社区"},
    "曲院社区":{position:[120.140849,30.268242],tit:"曲院社区"},
    "上保社区":{position:[120.156888,30.27117],tit:"上保社区"},
    "友谊社区":{position:[120.151726,30.274464],tit:"友谊社区"}
	
},
"蒋村街道": {
	"仕林社区":{position:[120.069107,30.289853],tit:"仕林社区"},						
    //"竞渡社区":{position:[120.06213,30.287111],tit:"竞渡社区"},
    "蝶园社区":{position:[120.069408,30.294812],tit:"蝶园社区"},
    "西溪里社区":{position:[120.064693,30.296563],tit:"西溪里社区"},						
    //"府苑社区":{position:[120.102597,30.271163],tit:"府苑社区"}
	
},
"留下街道": {
	"杨家牌楼社区":{position:[120.076514,30.251611],tit:"杨家牌楼社区"},												
    //"和家园":{position:[120.067497,30.239846],tit:"和家园"},                                                       
    //"茶市街":{position:[120.061904,30.243256],tit:"茶市街"},                                                       
    "翰墨香林":{position:[120.022501,30.215816],tit:"翰墨香林"}	
},
"三墩镇": {
	"墩和社区":{position:[120.074422,30.344211],tit:"墩和社区"},												
    //"双桥社区":{position:[120.038321,30.326684],tit:"双桥社区"},						
    //"五里塘社区":{position:[120.092612,30.326923],tit:"五里塘社区"},					
    "华乐社区":{position:[120.075116,30.344237],tit:"华乐社区"},						
    "庙前街社区":{position:[120.087914,30.324188],tit:"庙前街社区"},						
    //"南阳坝社区":{position:[120.089161,30.31951],tit:"南阳坝社区"},						
    //"大港桥社区":{position:[120.081692,30.329274],tit:"大港桥社区"},						
    "虾龙圩社区":{position:[120.102776,30.318344],tit:"虾龙圩社区"},						
    "厨房斗社区":{position:[120.084156,30.331988],tit:"厨房斗社区"},
    "荡王头社区":{position:[120.083412,30.336311],tit:"荡王头社区"},
    //"吉鸿社区":{position:[120.074312,30.346633],tit:"吉鸿社区"},
    "望月社区":{position:[120.09743,30.319862],tit:"望月社区"},
    //"三墩镇华联村蒋家斗25号":{position:[120.038667,30.352372],tit:"三墩镇华联村蒋家斗25号"},
    "嘉苑社区":{position:[120.074991,30.344119],tit:"嘉苑社区"},
    //"三坝社区":{position:[120.074991,30.344119],tit:"三坝社区"},
    //"塘河社区":{position:[120.059557,30.316454],tit:"塘河社区"},
    "五幸社区":{position:[120.058734,30.326914],tit:"五幸社区"},
    "文鼎苑社区":{position:[120.101313,30.305634],tit:"文鼎苑社区"},
    "自在城西苑社区":{position:[120.075011,30.336072],tit:"自在城西苑社区"},
    "紫金港社区":{position:[120.089011,30.316412],tit:"紫金港社区"},
    "政苑社区":{position:[120.110304,30.303341],tit:"政苑社区"},
    "兰里社区":{position:[120.088452,30.329205],tit:"兰里社区"},
    "水秀苑社区":{position:[120.100033,30.330278],tit:"水秀苑社区"},
    "新星社区":{position:[120.093775,30.329222],tit:"新星社区"},
    "罗家村社区":{position:[120.084156,30.331988],tit:"罗家村社区"},
    "水月社区":{position:[120.097652,30.319117],tit:"水月社区"},
    "颐兰社区":{position:[120.088496,30.337281],tit:"颐兰社区"},
    //"厚诚桥社区":{position:[120.085046,30.339577],tit:"厚诚桥社区"},
    "西苑社区":{position:[120.108606,30.317112],tit:"西苑社区"},
    //"金禹社区":{position:[120.08799,30.340853],tit:"金禹社区"},
    "金地自在城东苑":{position:[120.084576,30.344935],tit:"金地自在城东苑"},
    "陆板桥社区":{position:[120.086438,30.338032],tit:"陆板桥社区"},
    "杨家桥社区":{position:[120.079731,30.303506],tit:"杨家桥社区"},
    //"绕城村村委会":{position:[120.060948,30.343298],tit:"绕城村村委会"},
    //"山联村":{position:[120.041598,30.337431],tit:"山联村"}

	
},
"文新街道": {
	"湖畔社区":{position:[120.107956,30.294607],tit:"湖畔社区"},
    //"南都社区":{position:[120.110864,30.296155],tit:"南都社区"},
    //"星洲社区":{position:[120.10405,30.294982],tit:"星洲社区"},
    //"新金都社区":{position:[120.103107,30.288208],tit:"新金都社区"},
    //"竞舟社区":{position:[120.108696,30.289725],tit:"竞舟社区"},
    "香樟社区":{position:[120.113719,30.285229],tit:"香樟社区"},
    "沁雅社区":{position:[120.11216,30.281064],tit:"沁雅社区"},
    //"阳光社区":{position:[120.097276,30.29355],tit:"阳光社区"}	
},
"双浦镇": {
	"东江嘴村":{position:[120.171868,30.118898],tit:"东江嘴村"},
    //"外张村":{position:[120.157098,30.116982],tit:"外张村"},
    //"浦塘村":{position:[120.10977,30.113252],tit:"浦塘村"},
    //"新沙村":{position:[120.146944,30.133894],tit:"新沙村"},
    "小江村":{position:[120.130405,30.140926],tit:"小江村"},
    "桑园地村":{position:[120.104542,30.09571],tit:"桑园地村"},
    //"三阳村":{position:[120.077179,30.095797],tit:"三阳村"},
    //"袁家浦村":{position:[120.132839,30.123988],tit:"袁家浦村"},
    //"翁家埭村":{position:[120.08663,30.100762],tit:"翁家埭村"},					
    //"龙池村":{position:[120.125986,30.113227],tit:"龙池村"},
    //"跃河桥村":{position:[120.079864,30.09585],tit:"跃河桥村"}

	
},
"古荡街道": {
    "莲花社区":{position:[120.11693,30.279358],tit:"莲花社区"},
    //"古东社区":{position:[120.124502,30.280918],tit:"古东社区"},
    "文华社区":{position:[120.119134,30.297668],tit:"文华社区"},
    //"古北社区":{position:[120.121139,30.281348],tit:"古北社区"},
    "古南社区":{position:[120.121332,30.279253],tit:"古南社区"},
    "古墩社区":{position:[120.11146,30.277426],tit:"古墩社区"},
    "嘉绿苑社区":{position:[120.117511,30.287432],tit:"嘉绿苑社区"},
    "华星社区":{position:[120.12017,30.283431],tit:"华星社区"},
    //"嘉荷社区":{position:[120.111323,30.279339],tit:"嘉荷社区"}
        
	
},
"翠苑街道": {
	"翠苑三区社区":{position:[120.127574,30.296508],tit:"翠苑三区社区"},
    "翠苑四区社区":{position:[120.12903,30.292929],tit:"翠苑四区社区"}

	
},

"西溪街道": {
	"文天社区":{position:[120.154428,30.281297],tit:"文天社区"},
    "文教社区":{position:[120.146214,30.287539],tit:"文教社区"},
    "文锦社区":{position:[120.150994,30.288902],tit:"文锦社区"}

	
},
"灵隐街道": {
	"玉泉社区":{position:[120.131438,30.26604],tit:"玉泉社区"},						
    "黄龙社区":{position:[120.146143,30.2757],tit:"黄龙社区"},
    "东山弄社区":{position:[120.135491,30.2644],tit:"东山弄社区"},
    "浙大求是社区":{position:[120.139678,30.268981],tit:"浙大求是社区"},
    //"曙光社区":{position:[120.137546,30.267431],tit:"曙光社区"},
    "一一七社区":{position:[120.122649,30.252791],tit:"一一七社区"},
    "庆丰社区":{position:[120.134153,30.276857],tit:"庆丰社区"}

	
},
"转塘街道": {
	"叶埠桥社区":{position:[120.07493,30.186298],tit:"叶埠桥社区"},
    "石龙山社区":{position:[120.08584,30.142412],tit:"石龙山社区"},
    //"浮山社区":{position:[120.107368,30.13697],tit:"浮山社区"},
    "珊瑚沙社区":{position:[120.108815,30.171808],tit:"珊瑚沙社区"},
    //"大诸桥社区":{position:[120.083663,30.165999],tit:"大诸桥社区"},
    "葛衙庄社区":{position:[120.063599,30.18622],tit:"葛衙庄社区"},
    //"午山社区":{position:[120.096449,30.171663],tit:"午山社区"},
    //"金家岭社区":{position:[120.030557,30.150005],tit:"金家岭社区"},
    //"南村社区":{position:[120.109147,30.13036],tit:"南村社区"},
    "横桥社区":{position:[120.073902,30.166061],tit:"横桥社区"},
    "方家畈社区":{position:[120.079539,30.168782],tit:"方家畈社区"},
    //"长埭村":{position:[120.051578,30.175957],tit:"长埭村"},
    "双流社区":{position:[120.076048,30.14723],tit:"双流社区"},
    //"转塘街社区":{position:[120.08629,30.164881],tit:"转塘街社区"},
    //"尚德社区":{position:[120.089238,30.172192],tit:"尚德社区"},
    "转塘社区":{position:[120.085636,30.168489],tit:"转塘社区"},
    //"美院社区":{position:[120.079198,30.155381],tit:"美院社区"},
    //"江口社区":{position:[120.090737,30.167588],tit:"江口社区"},
    //"象山社区":{position:[120.087985,30.157358],tit:"象山社区"},
    //"中村社区":{position:[120.045629,30.152261],tit:"中村社区"},
    //"横埭街社区":{position:[120.111738,30.133772],tit:"横埭街社区"},
    //"贤家庄社区":{position:[120.098367,30.144997],tit:"贤家庄社区"},
    "慈母桥村":{position:[120.047512,30.193514],tit:"慈母桥村"},
    //"龙门坎村":{position:[120.038187,30.197735],tit:"龙门坎村"},
    //"何家村":{position:[120.043265,30.188894],tit:"何家村"},
    //"上城埭村":{position:[120.040234,30.179171],tit:"上城埭村"},
    "西湖茶场村":{position:[120.052029,30.17729],tit:"西湖茶场村"},
    //"外桐坞村":{position:[120.061893,30.20537],tit:"外桐坞村"},
    "桐坞村":{position:[120.057495,30.202956],tit:"桐坞村"},
    //"大清社区":{position:[120.077917,30.21125],tit:"大清社区"},
    "五云社区":{position:[120.116217,30.18579],tit:"五云社区"}	
},

//杭州拱墅区
"拱宸桥街道": {
	"永庆路社区": { position: [120.147803,30.333316], tit: "永庆路社区" },
	"蚕花园": { position: [120.153005,30.336168], tit: "蚕花园" },
	"登云阁": { position: [120.147515,30.320609], tit: "登云阁" },
	"新昌路": { position: [120.150901,30.32576], tit: "新昌路" }
	
},
"小河街道": {
	"小河社区": { position: [120.140416,30.311624], tit: "小河社区" },
	"紫荆家园社区": { position: [120.150737,30.317249], tit: "紫荆家园社区" },
	"余杭塘路社区": { position: [120.142506,30.300217], tit: "余杭塘路社区" },
	"娑婆桥社区": { position: [120.148318,30.305305], tit: "娑婆桥社区" },
	"董家新村社区": { position: [120.143494,30.305838], tit: "董家新村社区" },
	"明真宫社区": { position: [120.146252,30.308749], tit: "明真宫社区" }
},
"上塘街道": {
	"瓜山社区": { position: [120.156916,30.344534], tit: "瓜山社区" },
	"红建河社区": { position: [120.158475,30.317723], tit: "红建河社区" },
	"绍兴路社区": { position: [120.154868,30.319693], tit: "绍兴路社区" }
	
},
"米市巷街道": {
	"锦绣社区": { position: [120.158257,30.293814], tit: "锦绣社区" },
	"红石板社区": { position: [120.160383,30.289096], tit: "红石板社区" },
	"半道红社区": { position: [120.161604,30.283484], tit: "半道红社区" }	
},
"大关街道": {
	"东一社区": { position: [120.161829,30.31487], tit: "东一社区" },
	"东二社区": { position: [120.161179,30.313812], tit: "东二社区" },	
	//"西一社区": { position: [120.158293,30.314392], tit: "西一社区" },	
	"西二社区": { position: [120.162527,30.310522], tit: "西二社区" },
	"香积社区": { position: [120.163248,30.30626], tit: "香积社区" },
},
"半山街道": {
	"杭钢北苑社区": { position: [120.190098,30.356504], tit: "杭钢北苑社区" },
	"夏意社区": { position: [120.220191,30.367763], tit: "夏意社区" },
	"杭钢南苑社区": { position: [120.191201,30.353464], tit: "杭钢南苑社区" },
	"田园社区": { position: [120.195697,30.357564], tit: "田园社区" }		
},
"湖墅街道": {
	"卖鱼桥社区": { position: [120.152476,30.299402], tit: "卖鱼桥社区" },
	"双荡弄社区": { position: [120.152719,30.295712], tit: "双荡弄社区" },
	//"长乐苑社区": { position: [120.155132,30.308721], tit: "长乐苑社区" }
		
},
"和睦街道": {
	"和睦社区": { position: [120.129738,30.315512], tit: "和睦社区" },
	"华丰社区": { position: [120.018365,30.250234], tit: "华丰社区" }
		
},
	
	
	
//江干区
"采荷街道": {
	"芙蓉社区": { position: [120.200774,30.258733], tit: "芙蓉社区" },
	//"青荷苑社区": { position: [120.20317,30.255826], tit: "青荷苑社区" },
	"商教苑社区": { position: [120.19857,30.252699], tit: "商教苑社区" },
	"夕照社区": { position: [120.201951,30.250809], tit: "夕照社区" },
	//"江汀社区": { position: [120.208334,30.250094], tit: "江汀社区" },
	"静怡社区": { position: [120.206721,30.246833], tit: "静怡社区" },
	"健风社区": { position: [120.210341,30.259268], tit: "健风社区" },
	"新凯苑社区": { position: [120.196144,30.258696], tit: "新凯苑社区" },
	"荷花塘社区": { position: [120.200619,30.257286], tit: "荷花塘社区" },
	"红菱社区": { position: [120.205873,30.261699], tit: "红菱社区" },
	"绿茗社区": { position: [120.200671,30.254088], tit: "绿茗社区" }	
},
"彭埠街道": {
	"建华社区": { position: [120.252322,30.302851], tit: "建华社区" },
	"茶亭苑社区": { position: [120.230692,30.296217], tit: "茶亭苑社区" },
	"红五月社区": { position: [120.257545,30.314152], tit: "红五月社区" }		
},
"四季青街道": {
	//"钱杭社区": { position: [120.213003,30.261817], tit: "钱杭社区" },
	"三堡社区": { position: [120.224641,30.270104], tit: "三堡社区" },
	"钱江苑社区": { position: [120.220264,30.263995], tit: "钱江苑社区" },
	"五福社区": { position: [120.217548,30.268224], tit: "五福社区" },
	"运新社区": { position: [120.231067,30.278077], tit: "运新社区" },
	//"三叉社区": { position: [120.210297,30.267469], tit: "三叉社区" },
	"城星社区": { position: [120.21009,30.246325], tit: "城星社区" }		
},
"丁兰街道": {
	"皋城村": { position: [120.235411,30.385536], tit: "皋城村" },
	"丁桥苑社区": { position: [120.238696,30.355159], tit: "丁桥苑社区" },
	"长睦苑社区": { position: [120.2394,30.362476], tit: "长睦苑社区" },
	"蕙兰社区": { position: [120.240995,30.352039], tit: "蕙兰社区" },
	"长虹社区": { position: [120.290154,30.500047], tit: "长虹社区" },
	"枫景园社区": { position: [120.249379,30.368988], tit: "枫景园社区" },
	"河西社区": { position: [120.236661,30.350136], tit: "河西社区" },
	"三义苑社区": { position: [120.23912,30.376306], tit: "三义苑社区" },
	"赵家苑社区": { position: [120.227878,30.36261], tit: "赵家苑社区" },
	"华亭社区": { position: [120.25027,30.36902], tit: "华亭社区" },
	//"华鹤社区": { position: [120.245962,30.376291 ], tit: "华鹤社区" }	
},
"闸弄口街道": {
	//"天杭社区": { position: [120.200727,30.284751], tit: "天杭社区" },
	"万家花园社区": { position:[120.211759,30.291638], tit: "万家花园社区" },
	"濮家联合社区": { position: [120.204831,30.289258], tit: "濮家联合社区" },
	"红梅社区": { position: [120.195544,30.300356], tit: "红梅社区" },
	"春晖社区": { position: [120.201779,30.300136], tit: "春晖社区" },
	"董家社区": { position: [120.195655,30.297692], tit: "董家社区" },
	"三里亭社区": { position: [120.195733,30.297301], tit: "三里亭社区" },
	"兰苑社区": { position: [120.194889,30.295392], tit: "兰苑社区" },
	"天运社区": { position: [120.209138,30.289296], tit: "天运社区" },
	"麦苗社区": { position: [120.197471,30.302945], tit: "麦苗社区" }
	
},
"凯旋街道": {
	"庆春门社区": { position: [120.205583,30.263683], tit: "庆春门社区" },
	"景秀社区": { position: [120.209194,30.272755], tit: "景秀社区" },
	"金秋花园": { position: [120.20646,30.270319], tit: "金秋花园" },
	"景芳社区": { position: [120.21115,30.277085], tit: "景芳社区" },
	"景华社区": { position: [120.216346,30.27901], tit: "景华社区" },
	"华家池社区": { position: [120.198353,30.273221], tit: "华家池社区" },
	//"南肖埠社区": { position: [120.204643,30.268507], tit: "南肖埠社区" },
	"景新社区": { position: [120.211838,30.274721], tit: "景新社区" },
	"景苑社区": { position: [120.215538,30.275071], tit: "景苑社区" },
	"景湖社区": { position: [120.219041,30.275908], tit: "景湖社区" },
	"景昙社区": { position: [120.209333,30.274791], tit: "景昙社区" }	
},	
"笕桥街道": {
	"笕新社区": { position: [120.215258,30.327822], tit: "笕新社区" },
	"黄家社区": { position: [120.243627,30.324505], tit: "黄家社区" },
	"农科院社区": { position: [120.203392,30.314727], tit: "农科院社区" },
	"机场社区": { position: [120.219637,30.31691], tit: "机场社区" }
	
},
"九堡街道": {
	"杨公社区": { position: [120.284814,30.303902], tit: "杨公社区" },
	"八堡社区": { position: [120.299514,30.309944], tit: "八堡社区" },
	"牛田社区": { position: [120.270742,30.311006], tit: "牛田社区" },
	"蚕桑社区": { position: [120.274879,30.318917], tit: "蚕桑社区" },
	"金海社区": { position: [120.275101,30.316387], tit: "金海社区" },
	"蓝桥社区": { position: [120.2843,30.311328], tit: "蓝桥社区" },
	"和华社区": { position: [120.270396,30.327264], tit: "和华社区" },
	"金雅苑社区": { position: [120.287944,30.314158], tit: "金雅苑社区" },
	"江涛社区": { position: [120.281635,30.303795], tit: "江涛社区" },
	"景蓝社区": { position: [120.285445,30.31241], tit: "景蓝社区" },
	"三卫社区": { position: [120.276459,30.339112], tit: "三卫社区" },
	"九堡社区": { position: [120.279802,30.316296], tit: "九堡社区" },
	"三村村": { position: [120.251859,30.331006], tit: "三村村" }		
},

    "湖滨": {

        "染坊弄6号": { position: [120.17247, 30.252983], tit: "染坊弄6号" },
        "邮电路42号": { position: [120.173756, 30.257531], tit: "邮电路42号" },
        "东坡路社区": { position: [120.17219, 30.263393], tit: "东坡路社区" },
        "积善坊巷19号": { position: [120.17533, 30.254406], tit: "积善坊巷19号" }
    },
    "小营": {		
        "马坡巷": { position: [120.190815, 30.255437], tit: "马坡巷" },
        "大塔儿巷": { position: [120.178819, 30.25817], tit: "大塔儿巷" },
        "直大方伯": { position: [120.185233, 30.263572], tit: "直大方伯" },
        "长明寺巷口": { position: [120.188919, 30.25317], tit: "长明寺巷口" },
        "大王庙小区": { position: [120.183615, 30.261629], tit: "大王庙小区" },
        "清吟街108号旁": { position: [120.186529, 30.254142], tit: "清吟街108号旁" },
        "老浙大直路23号": { position: [120.191456, 30.260441], tit: "老浙大直路23号" },
        "直吉祥巷14号旁": { position: [120.182289, 30.247118], tit: "直吉祥巷14号旁" },
        "老浙大横路三弄": { position: [120.189985, 30.260823], tit: "老浙大横路三弄" },
        "小营巷银枪新村": { position: [120.184777, 30.258011], tit: "小营巷银枪新村" },
        "大学路新村36号旁": { position: [120.190318, 30.257053], tit: "大学路新村36号旁" },
        //"直大方伯银枪新村": { position: [120.184938, 30.257632], tit: "直大方伯银枪新村" },
        "西牌楼社区建国南苑8幢和5幢": { position: [120.183059, 30.243605], tit: "西牌楼社区建国南苑8幢和5幢" },
        "金钱巷社区(南班巷11幢后15幢后)": { position: [120.18346, 30.253587], tit: "金钱巷社区(南班巷11幢后15幢后)" }
    },
    "望江": {

        //"新丰苑": { position: [120.30495, 30.419247], tit: "新丰苑" },
        "在水一方": { position: [120.196464, 30.23947], tit: "在水一方" },
        "沙地路公园": { position: [120.19529, 30.240317], tit: "沙地路公园" },
        "新丰新村1幢": { position: [120.198096, 30.249347], tit: "新丰新村1幢" },
        "秋涛一弄20-22": { position: [120.196606, 30.247998], tit: "秋涛一弄20-22" },
        "婺江家园二园": { position: [120.199918, 30.242443], tit: "婺江家园二园" },
        "近江东园社区": { position: [120.208251, 30.23617], tit: "近江东园社区" },
        "近江西园社区": { position: [120.203418, 30.239308], tit: "近江西园社区" },
       // "社区计生公园前": { position: [120.206238, 30.237313], tit: "社区计生公园前" },
        "清静弄胜利小学围墙外围": { position: [120.207849, 30.24213], tit: "清静弄胜利小学围墙外围" }
    },
    "南星": {

        //"紫花埠社区": { position: [120.178806, 30.217785], tit: "紫花埠社区" },
        "馒头山社区": { position: [120.174377, 30.224092], tit: "馒头山社区" },
        "水澄桥社区": { position: [120.160348, 30.210533], tit: "水澄桥社区" },
        "八卦新村门口": { position: [120.157521, 30.21295], tit: "八卦新村门口" },
        "复兴北苑4幢边": { position: [120.17282, 30.217121], tit: "复兴北苑4幢边" },
        "复兴北苑15幢边": { position: [120.170886, 30.21563], tit: "复兴北苑15幢边" },
        "美政花苑18幢边": { position: [120.178188, 30.218233], tit: "美政花苑18幢边" },
        "复兴街社区门口": { position: [120.172127, 30.214024], tit: "复兴街社区门口" },
        //"玉皇山社区电厂": { position: [120.157361, 30.212499], tit: "玉皇山社区电厂" },
        "复兴南苑2号门边": { position: [120.174388, 30.216667], tit: "复兴南苑2号门边" },
        "复兴南苑3号门边": { position: [120.172458, 30.214998], tit: "复兴南苑3号门边" },
        "金棕榈花园4幢边": { position: [120.169645, 30.212584], tit: "金棕榈花园4幢边" },
        "复兴城市家园门口": { position: [120.163748, 30.214002], tit: "复兴城市家园门口" },
        "十亩田家园西大门口": { position: [120.16591, 30.213115], tit: "十亩田家园西大门口" },
        "白塔岭社区兰巷6号旁": { position: [120.157569, 30.210256], tit: "白塔岭社区兰巷6号旁" },
        //"民安苑小区复兴路大门": { position: [120.16051, 30.210231], tit: "民安苑小区复兴路大门" }
    },
    "紫阳": {

        "直箭道巷3幢旁": { position: [120.180382, 30.233587], tit: "直箭道巷3幢旁" },
        "保安桥直街": { position: [120.179474, 30.239687], tit: "保安桥直街" },
        "北落马营社区": { position: [120.182413, 30.231826], tit: "北落马营社区" },
        "抚宁巷小学旁": { position: [120.182276, 30.241598], tit: "抚宁巷小学旁" },
        "新工新村1幢边": { position: [120.181591, 30.226387], tit: "新工新村1幢边" }
    },
    "清波": {

        "三衙前": { position: [120.167022, 30.246722], tit: "三衙前" },
        "清波门": { position: [120.164745, 30.245292], tit: "清波门" },
        "三元地3号": { position: [120.173573, 30.24771], tit: "三元地3号" },
        "后市街46号": { position: [120.175689, 30.247917], tit: "后市街46号" },
        "定安苑小区": { position: [120.173652, 30.249656], tit: "定安苑小区" },
       // "荷花池头30号": { position: [120.165742, 30.24694], tit: "荷花池头30号" },
        "光复路38号旁": { position: [120.178077, 30.249035], tit: "光复路38号旁" },
       // "清波新村小区内": { position: [120.165593, 30.242666], tit: "清波新村小区内" },
        "铁冶路7-2号对面": { position: [120.167209, 30.24284], tit: "铁冶路7-2号对面" },
        "柳翠井巷55号对面": { position: [120.178321, 30.249944], tit: "柳翠井巷55号对面" },
        //"后市街小区南大门": { position: [120.17581, 30.248827], tit: "后市街小区南大门" },
        "高银街(小绍兴酒楼对面)": { position: [120.173379, 30.246392], tit: "高银街(小绍兴酒楼对面)" }
    },
    //修改                          
    "走廊/楼道": {
        "彩霞岭": { position: [120.17935,30.239529], tit: "彩霞岭" },
        "在水一方": { position: [120.196464,30.23947], tit: "在水一方" },
        "清河坊社区": { position: [120.173876,30.247328], tit: "清河坊社区" },
        "东平巷社区": { position: [120.175662,30.253729], tit: "东平巷社区" },
        "茅廊巷社区": { position: [120.181101,30.252071], tit: "茅廊巷社区" },
        "梅花碑社区": { position: [120.179588,30.247104], tit: "梅花碑社区" },
        //"水澄桥社区": { position: [120.160348,30.210533], tit: "水澄桥社区" },
        "徐家埠社区": { position: [120.204103,30.244407], tit: "徐家埠社区" },
        "上羊市街社区": { position: [120.181734,30.240739], tit: "上羊市街社区" }
    }
    
}
