var theCity = {
    "杭州":{
        "杭州上城区":{
            "title":"杭州上城区","position":[120.175901,30.248034]
        }
    }
}
//不动

//
var jb = {

    "杭州上城区":{
        "湖滨":{position:[120.172963,30.258332],tit:"湖滨"},
        "小营":{position:[120.183243,30.245295],tit:"小营"},
        "望江":{position:[120.191167,30.237708],tit:"望江"},
        "南星":{position:[120.178841,30.220677],tit:"南星"},
        "紫阳":{position:[120.176833,30.237785],tit:"紫阳"},
        "清波":{position:[120.167417,30.244115],tit:"清波"},
    },
}

var allJiedao = {

    "湖滨": {

        "染坊弄6号": { position: [120.17247, 30.252983], tit: "染坊弄6号" },
        "邮电路42号": { position: [120.173756, 30.257531], tit: "邮电路42号" },
        "东坡路社区": { position: [120.17219, 30.263393], tit: "东坡路社区" },
        "积善坊巷19号": { position: [120.17533, 30.254406], tit: "积善坊巷19号" }
    },
    "小营": {

        "马坡巷": { position: [120.190815, 30.255437], tit: "马坡巷" },
        "大塔儿巷": { position: [120.178819, 30.25817], tit: "大塔儿巷" },
        "直大方伯": { position: [120.185233, 30.263572], tit: "直大方伯" },
        "长明寺巷口": { position: [120.188919, 30.25317], tit: "长明寺巷口" },
        "大王庙小区": { position: [120.183615, 30.261629], tit: "大王庙小区" },
        "清吟街108号旁": { position: [120.186529, 30.254142], tit: "清吟街108号旁" },
        "老浙大直路23号": { position: [120.191456, 30.260441], tit: "老浙大直路23号" },
        "直吉祥巷14号旁": { position: [120.182289, 30.247118], tit: "直吉祥巷14号旁" },
        "老浙大横路三弄": { position: [120.189985, 30.260823], tit: "老浙大横路三弄" },
        "小营巷银枪新村": { position: [120.184777, 30.258011], tit: "小营巷银枪新村" },
        "大学路新村36号旁": { position: [120.190318, 30.257053], tit: "大学路新村36号旁" },
        "直大方伯银枪新村": { position: [120.184938, 30.257632], tit: "直大方伯银枪新村" },
        "西牌楼社区建国南苑8幢和5幢": { position: [120.183059, 30.243605], tit: "西牌楼社区建国南苑8幢和5幢" },
        "金钱巷社区(南班巷11幢后15幢后)": { position: [120.18346, 30.253587], tit: "金钱巷社区(南班巷11幢后15幢后)" }
    },
    "望江": {

        "新丰苑": { position: [120.30495, 30.419247], tit: "新丰苑" },
        "在水一方": { position: [120.196464, 30.23947], tit: "在水一方" },
        "沙地路公园": { position: [120.19529, 30.240317], tit: "沙地路公园" },
        "新丰新村1幢": { position: [120.198096, 30.249347], tit: "新丰新村1幢" },
        "秋涛一弄20-22": { position: [120.196606, 30.247998], tit: "秋涛一弄20-22" },
        "婺江家园二园": { position: [120.199918, 30.242443], tit: "婺江家园二园" },
        "近江东园社区": { position: [120.208251, 30.23617], tit: "近江东园社区" },
        "近江西园社区": { position: [120.203418, 30.239308], tit: "近江西园社区" },
        "社区计生公园前": { position: [120.206238, 30.237313], tit: "社区计生公园前" },
        "清静弄胜利小学围墙外围": { position: [120.207849, 30.24213], tit: "清静弄胜利小学围墙外围" }
    },
    "南星": {

        "紫花埠社区": { position: [120.178806, 30.217785], tit: "紫花埠社区" },
        "馒头山社区": { position: [120.174377, 30.224092], tit: "馒头山社区" },
        "水澄桥社区": { position: [120.160348, 30.210533], tit: "水澄桥社区" },
        "八卦新村门口": { position: [120.157521, 30.21295], tit: "八卦新村门口" },
        "复兴北苑4幢边": { position: [120.17282, 30.217121], tit: "复兴北苑4幢边" },
        "复兴北苑15幢边": { position: [120.170886, 30.21563], tit: "复兴北苑15幢边" },
        "美政花苑18幢边": { position: [120.178188, 30.218233], tit: "美政花苑18幢边" },
        "复兴街社区门口": { position: [120.172127, 30.214024], tit: "复兴街社区门口" },
        "玉皇山社区电厂": { position: [120.157361, 30.212499], tit: "玉皇山社区电厂" },
        "复兴南苑2号门边": { position: [120.174388, 30.216667], tit: "复兴南苑2号门边" },
        "复兴南苑3号门边": { position: [120.172458, 30.214998], tit: "复兴南苑3号门边" },
        "金棕榈花园4幢边": { position: [120.169645, 30.212584], tit: "金棕榈花园4幢边" },
        "复兴城市家园门口": { position: [120.163748, 30.214002], tit: "复兴城市家园门口" },
        "十亩田家园西大门口": { position: [120.16591, 30.213115], tit: "十亩田家园西大门口" },
        "白塔岭社区兰巷6号旁": { position: [120.157569, 30.210256], tit: "白塔岭社区兰巷6号旁" },
        "民安苑小区复兴路大门": { position: [120.16051, 30.210231], tit: "民安苑小区复兴路大门" }
    },
    "紫阳": {

        "直箭道巷3幢旁": { position: [120.180382, 30.233587], tit: "直箭道巷3幢旁" },
        "保安桥直街": { position: [120.179474, 30.239687], tit: "保安桥直街" },
        "北落马营社区": { position: [120.182413, 30.231826], tit: "北落马营社区" },
        "抚宁巷小学旁": { position: [120.182276, 30.241598], tit: "抚宁巷小学旁" },
        "新工新村1幢边": { position: [120.181591, 30.226387], tit: "新工新村1幢边" }
    },
    "清波": {

        "三衙前": { position: [120.167022, 30.246722], tit: "三衙前" },
        "清波门": { position: [120.164745, 30.245292], tit: "清波门" },
        "三元地3号": { position: [120.173573, 30.24771], tit: "三元地3号" },
        "后市街46号": { position: [120.175689, 30.247917], tit: "后市街46号" },
        "定安苑小区": { position: [120.173652, 30.249656], tit: "定安苑小区" },
        "荷花池头30号": { position: [120.165742, 30.24694], tit: "荷花池头30号" },
        "光复路38号旁": { position: [120.178077, 30.249035], tit: "光复路38号旁" },
        "清波新村小区内": { position: [120.165593, 30.242666], tit: "清波新村小区内" },
        "铁冶路7-2号对面": { position: [120.167209, 30.24284], tit: "铁冶路7-2号对面" },
        "柳翠井巷55号对面": { position: [120.178321, 30.249944], tit: "柳翠井巷55号对面" },
        "后市街小区南大门": { position: [120.17581, 30.248827], tit: "后市街小区南大门" },
        "高银街(小绍兴酒楼对面)": { position: [120.173379, 30.246392], tit: "高银街(小绍兴酒楼对面)" }
    },
    //修改
    
    
    
    
    
    
    
    
    "走廊/楼道": {
        "彩霞岭": { position: [120.17935,30.239529], tit: "彩霞岭" },
        "在水一方": { position: [120.196464,30.23947], tit: "在水一方" },
        "清河坊社区": { position: [120.173876,30.247328], tit: "清河坊社区" },
        "东平巷社区": { position: [120.175662,30.253729], tit: "东平巷社区" },
        "茅廊巷社区": { position: [120.181101,30.252071], tit: "茅廊巷社区" },
        "梅花碑社区": { position: [120.179588,30.247104], tit: "梅花碑社区" },
        "水澄桥社区": { position: [120.160348,30.210533], tit: "水澄桥社区" },
        "徐家埠社区": { position: [120.204103,30.244407], tit: "徐家埠社区" },
        "上羊市街社区": { position: [120.181734,30.240739], tit: "上羊市街社区" }
    }
    
}
